[{"id":"22e9ee02-45c6-4e96-bcc3-c72db00185fc","type":"Full Time","url":"https://jobs.github.com/positions/22e9ee02-45c6-4e96-bcc3-c72db00185fc","created_at":"Thu Nov 26 13:15:05 UTC 2020","company":"GOhiring GmbH","company_url":"https://www.gohiring.com/","location":"Berlin | Remote","title":"Senior fullstack developer React / Ruby","description":"\u003cp\u003eWe as GOhiring believe that connectivity is the foundation of efficient processes. Therefore we offer the digital infrastructure for HR Market Players to provide a productive way of collaborating. Our software solution enables customers to publish, manage and analyze their job postings within their HR software. Thanks to state-of-the-art tools, we have also digitized our own working environment. Everything is set up for #remote work from anywhere in the world.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild smart, customer-driven front- and back-end solutions in extension of our product ecosystem\u003c/li\u003e\n\u003cli\u003eSolve exciting engineering challenges, starting with MVP’s and iterate from there\u003c/li\u003e\n\u003cli\u003eWork on complex frontend projects using React and other JS frameworks\u003c/li\u003e\n\u003cli\u003eCollaborate closely with our experienced team of backend developers, product managers, designers and testers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou get excited about good quality code and engineering quests\u003c/li\u003e\n\u003cli\u003e+5 years experience in web development, including +1 years in React.js and +3 years in Ruby\u003c/li\u003e\n\u003cli\u003eValue testing, well-documented code and intelligent software design techniques\u003c/li\u003e\n\u003cli\u003eProfound knowledge about API Design and performance optimization\u003c/li\u003e\n\u003cli\u003eFluent in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy should you apply?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRemote culture\u003c/em\u003e - Work wherever you are most productive - at home, while traveling or in our office in Berlin. Benefit from processes and mindsets which are 100% oriented towards working flexible hours.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSmall, agile team\u003c/em\u003e - We believe that work is simply more fun in small teams. Experienced colleagues, jointly defined company targets, a direct exchange and lots of creative leeway: That is what constitutes our understanding of productivity.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eComplex challenges\u003c/em\u003e - We encounter new challenges time and time which are waiting to be solved for the benefit of all market players.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSounds like an interesting challenge for you?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSimply send us your profile in addition to your Github handle. We are happy to hear from you.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/a039bb22652098d616d5143345f1ac6a9a48ddba/68747470733a2f2f742e676f686972696e672e636f6d2f682f34336664383035383361333334346533383038356236666563376566393632376364393435373266656464346434616339323463353234303339633639363833\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/6011f9633d101d8b048afcc1c627ecbc2850d5e697acd88344efb1efa1adefd4\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanFSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c613875ab3f6e82766ffdac9dea30580a9c417a6/GOhiring.jpg"},{"id":"e7892a26-7417-4e50-9d12-568c34a002c3","type":"Full Time","url":"https://jobs.github.com/positions/e7892a26-7417-4e50-9d12-568c34a002c3","created_at":"Wed Nov 25 18:17:23 UTC 2020","company":"Datica, Inc","company_url":"http://datica.com","location":"United States","title":"Software Engineer","description":"\u003cp\u003eWe are looking for an experienced Software Engineer to join our team supporting our customers as they tackle healthcare in the Cloud! In this role you will design, develop, and build secure and compliant solutions across our products to help our customers deploy and manage healthcare information in the Cloud.\u003c/p\u003e\n\u003cp\u003eWhat you’ll be doing\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs a Software Engineer on a remote team, work directly with other Engineers, QA, Product\nManagement, and Operations in an Agile environment\u003c/li\u003e\n\u003cli\u003eDevelop elegant, efficient, and test-driven code while building features and supporting our\nproducts\u003c/li\u003e\n\u003cli\u003eProvide technical leadership and participate in architectural decision-making on new capabilities\nand automation\u003c/li\u003e\n\u003cli\u003eDrive new features from inception to design to production release\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDegree in Computer Science, Software Engineering, or equivalent experience\u003c/li\u003e\n\u003cli\u003eFour years software engineering experience\u003c/li\u003e\n\u003cli\u003eProven ability to deliver working software for a complex system\u003c/li\u003e\n\u003cli\u003eAbility to work effectively in a group setting using source control, performing code reviews, and\npairing as necessary\u003c/li\u003e\n\u003cli\u003eFamiliarity with Docker and orchestration tools like Kubernetes or AWS ECS Experience deploying\nin IaaS environments, particularly AWS\u003c/li\u003e\n\u003cli\u003eDelivering software within a regulated industry (healthcare, finance, etc.) a huge plus\u003c/li\u003e\n\u003cli\u003eExperience with CloudFormation, Salt, Terraform, Ansible, or other DevOps tooling\u003c/li\u003e\n\u003cli\u003eExperience with the AWS CDK a huge plus (though not required)\u003c/li\u003e\n\u003cli\u003eExperience with computer security, information assurance, information security\u003c/li\u003e\n\u003cli\u003eExperience delivering production services built with Javascript, Typescript, Go or Python\u003c/li\u003e\n\u003cli\u003eExperience writing extensive tests with a passion for automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Must be authorized to work in the United States.\u003c/p\u003e\n\u003cp\u003e**No recruiting firms please\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply directly at datica.com/careers\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaStSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5dfc046e71757a7f32e4b02c5a0b89d4ea34251c/Datica%20Logo.png"},{"id":"d5fec958-5aca-4d12-9d56-1a61e66fba60","type":"Full Time","url":"https://jobs.github.com/positions/d5fec958-5aca-4d12-9d56-1a61e66fba60","created_at":"Wed Nov 25 17:32:52 UTC 2020","company":"Potato London Ltd","company_url":"http:","location":"London","title":"Python / Django Engineer ","description":"\u003cp\u003eAbout the role:\u003c/p\u003e\n\u003cp\u003eAs an Engineer, your main focus is project work, working closely with designers, coaches, product leads, and with guidance and mentoring from other members of the Engineering team. You will be assigned a representative from the Engineering team (usually a Team Engineer or Tech Community Lead) to aid your progression and help you move forward with your career at Potato.\u003c/p\u003e\n\u003cp\u003eYou will join one of our friendly, supportive, proactive Agile product teams, you’ll be working closely with fellow developers, designers, and other team members. Our teams are self-organising, with the freedom to define their own ways of working.\u003c/p\u003e\n\u003cp\u003eMost of our products are web-based and use Python on the server, most often Django on Google App Engine (sometimes Firebase, AWS, or Azure). We use a mix of relational and non-relational databases, and other cloud services. We aim to strike a balance between leveraging our existing strengths and exploring new tech. While this listing focusses on Python, we try to avoid silos: our developers are encouraged to contribute to any part of a system they’d like to. We’re particularly interested in speaking to applicants with a background in security, or those with a good knowledge of security vulnerabilities and how to prevent them.\u003c/p\u003e\n\n\u003cp\u003eAbout you:\u003c/p\u003e\n\u003cp\u003eWe expect developers at Potato to be able to find creative solutions to technical problems and user needs, whilst also finding opportunities to optimise and simplify software. For this role, we’re looking for someone capable of supporting, guiding and empowering teams to produce excellent software, striking the right balance between perfection and delivery. Experience with Google App Engine is a plus, but not mandatory.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone who writes great code, but also enjoys collaborating with other disciplines in the product team to devise creative solutions to the users’ needs. For this role, you should have an appreciation of the full web stack, as well as an appreciation of current trends in both backend and frontend web technologies.\u003c/p\u003e\n\n\u003cp\u003eYou will be accountable for:\u003c/p\u003e\n\u003cp\u003eWrite idiomatic, performant and maintainable code\u003c/p\u003e\n\u003cp\u003eFind creative solutions to technical problems and user needs, whilst also finding opportunities to optimise and simplify software\u003c/p\u003e\n\u003cp\u003eStrike the right balance between perfection and delivery\u003c/p\u003e\n\u003cp\u003eWork in a friendly, self-organising, cross-functional, Agile product team\u003c/p\u003e\n\u003cp\u003eSupport other Engineers within the team\u003c/p\u003e\n\u003cp\u003eCollaborate closely with other disciplines such as Designers and Product Leads\u003c/p\u003e\n\u003cp\u003eArchitecting the backend of new projects, or large additions to existing code-bases\u003c/p\u003e\n\n\u003cp\u003eYou must have:\u003c/p\u003e\n\u003cp\u003eExperience building for the web using Python and Django\u003c/p\u003e\n\u003cp\u003eExperience using modern development tools (e.g. Git, GitLab or GitHub etc.) within a development team\u003c/p\u003e\n\u003cp\u003eExcellent teamwork, and written and verbal communication skills\u003c/p\u003e\n\n\u003cp\u003eIdeally also:\u003c/p\u003e\n\u003cp\u003eAn understanding of security vulnerabilities and how to prevent them\u003c/p\u003e\n\u003cp\u003eExperience with backend Python frameworks such as Flask or FastAPI\u003c/p\u003e\n\u003cp\u003eExperience launching high-quality digital products\u003c/p\u003e\n\u003cp\u003eExperience with Google App Engine or a similar PaaS\u003c/p\u003e\n\u003cp\u003eAn understanding of both relational and non-relational databases\u003c/p\u003e\n\u003cp\u003eExperience creating secure and well-designed APIs\u003c/p\u003e\n\u003cp\u003eExperience building for scale: high traffic, big data, large feature sets\u003c/p\u003e\n\u003cp\u003eFront-end web or native app development skills\u003c/p\u003e\n\u003cp\u003eKnowledge of testing, QA tools and methodologies\u003c/p\u003e\n\u003cp\u003eFamiliarity with Agile methodologies such as Scrum and Kanban\u003c/p\u003e\n\n\u003cp\u003eCulture:\u003c/p\u003e\n\u003cp\u003eWorking shoulder-to-shoulder with some of the best engineers, designers and product leads in town, we’ll give you the freedom to manage your own work and trust you to get things done. Want to work from home occasionally? Go for it. Need to unwind with a game of pool or some studio dog cuddles? All good. Ultimately, we just want to make sure that you have everything you need to help us build the best products possible.\u003c/p\u003e\n\u003cp\u003eYou’ll have many opportunities for growth and learning: collaboration within teams, rotation to different products, experimentation on internal tools, involvement in new business and pitching, our Potato Talks events, mentorship, training courses, and conferences.\u003c/p\u003e\n\n\u003cp\u003eInclusivity:\u003c/p\u003e\n\u003cp\u003eWe want to make our hiring as inclusive as possible, this job description has been reviewed by a range of employees and has passed a neutral language check. We have also reviewed our hiring process to make sure it offers flexibility to candidates that need it.\u003c/p\u003e\n\u003cp\u003eWe're trying to do better and would love your feedback. If you think there's anything we could improve, or places you think we should advertise, then please let us know.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://p.ota.to/jobs/python-django-engineer-london?t=0a7c0bc11us\"\u003ehttps://p.ota.to/jobs/python-django-engineer-london?t=0a7c0bc11us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--48b0ead54624ad637c5fd10cafcb5a6e807f03d4/logo-colour_on_light-transparent.png"},{"id":"392ff0d0-e5c9-4624-be45-dff8c21a2351","type":"Full Time","url":"https://jobs.github.com/positions/392ff0d0-e5c9-4624-be45-dff8c21a2351","created_at":"Wed Nov 25 16:42:13 UTC 2020","company":"Rightmove","company_url":"http://www.lorienglobal.com","location":"Soho, London","title":"Backend Developer - Rightmove.co.uk","description":"\u003cp\u003eExciting opportunity for a #backend #developer!\u003c/p\u003e\n\u003cp\u003eAre you an expert in #Java, #Node, #Springboot or #Kafka?\u003c/p\u003e\n\u003cp\u003eRightmove are looking to hire a new member of their fast-growing digital team in #London – and you could be it! We’re looking for passionate people that want to lead this household name on its digital journey.\u003c/p\u003e\n\u003cp\u003eBonus points if you have experience in #Docker, #AWS or #Gradle.\u003c/p\u003e\n\u003cp\u003eApply now and Rightmove’s technology recruitment partner Lorien will be in touch about next steps!\u003c/p\u003e\n\u003cp\u003eApply here: \u003ca href=\"https://bit.ly/2UYuPIa\"\u003ehttps://bit.ly/2UYuPIa\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to Eliza-Grace Eaton at \u003ca href=\"mailto:Eliza-Grace.Eaton@lorienglobal.com\"\u003eEliza-Grace.Eaton@lorienglobal.com\u003c/a\u003e or apply here: \u003ca href=\"https://bit.ly/2UYuPIa\"\u003ehttps://bit.ly/2UYuPIa\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f4952376eb7e3be044c58be0faa173878eb4fc2a/Rightmove%20Logo.png"},{"id":"445acbc9-9ca0-409b-b460-66619d3e4135","type":"Full Time","url":"https://jobs.github.com/positions/445acbc9-9ca0-409b-b460-66619d3e4135","created_at":"Wed Nov 25 16:41:36 UTC 2020","company":"Axios","company_url":"http://Axios","location":"Remote (USA)","title":"Senior Mobile Engineer (React Native)","description":"\u003cp\u003eQuick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We are hiring a Senior Mobile Engineer!\u003c/p\u003e\n\u003cp\u003eWhy it Matters: Our Mobile Engineers are a critical part of our mission to deliver the cleanest, smartest, most efficient and trustworthy content to our users. You will architect and grow new and existing codebases, give technical input and feedback to Axios’ product and design teams for new features, and help develop the skills of your teammates with industry best practices around testing, accessibility, and documentation.\u003c/p\u003e\n\u003cp\u003eGo Deeper: In this role, you will make an impact on Axios through the following responsibilities:\u003c/p\u003e\n\u003cp\u003eHelp architect and build significant new features in the Axios mobile app\nPartner with Senior Mobile, Frontend and React Native engineers on the team\nWrite clean, well-documented, and well-tested code using best practices for React and React Native development\nCollaborate with Axios’ platform, product, and design teams to ensure we quickly ship and iterate on high-quality products\nDebug and develop mobile platform-specific features on iOS and Android in a React Native codebase\nMentor and coach members of the team through pair-programming and empathetic code review\nStay up to date with industry trends and advise the team on best practices to implement\nThe Details: Ideal candidates will embody an entrepreneurial spirit and passion for Axios’ mission and have the following skills:\u003c/p\u003e\n\u003cp\u003eExperience building large, high traffic frontend codebases in React Native\nProven ability to ship high quality, testable, and accessible code quickly\nExperience working on cross-functional teams is preferred\nExperience working on mobile performance and accessibility is preferred\nExperience debugging mobile applications on iOS and Android is preferred\nDon’t Forget:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\nAdditional pandemic-related benefits:\u003c/p\u003e\n\u003cp\u003eOne mental health day per month\n$100 monthly work-from-home stipend\nTele-mental health services\nOneMedical membership, including tele-health services\nIncreased work flexibility for parents and caretakers\nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies\nWeekly company-sponsored exercise and meditation classes\nVirtual company-sponsored social events\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/ce61b26c1us\"\u003ehttps://grnh.se/ce61b26c1us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUNSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--97ed95831da75eeeeba1846640872f9ce43c45e8/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"},{"id":"9cebff17-8be6-466b-acff-dd5e0a083ac8","type":"Full Time","url":"https://jobs.github.com/positions/9cebff17-8be6-466b-acff-dd5e0a083ac8","created_at":"Wed Nov 25 16:19:56 UTC 2020","company":"Raycast","company_url":"https://raycast.com","location":"Remote, EU","title":"Software Engineer, macOS","description":"\u003ch2\u003eTL;DR\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a productivity tool for developers\u003c/li\u003e\n\u003cli\u003eSmall team that is light on processes\u003c/li\u003e\n\u003cli\u003eFully remote (EU-friendly timezones)\u003c/li\u003e\n\u003cli\u003eBacked by great investors (\u003ca href=\"https://www.ycombinator.com\"\u003eY Combinator\u003c/a\u003e, \u003ca href=\"https://www.accel.com/noteworthy/giving-developers-superpowers-our-investment-in-raycast\"\u003eAccel\u003c/a\u003e, \u003ca href=\"https://chapterone.com\"\u003eChapter One\u003c/a\u003e and top angels)\u003c/li\u003e\n\u003cli\u003eModern perks (MacBook Pro with 5k display, co-working space, monthly health benefit, ...)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDescription\u003c/h2\u003e\n\u003cp\u003eRaycast makes it simple, fast and delightful to control your tools. We're looking for a Software Engineer to join our small team to craft, shape and improve our macOS app that redefines productivity tools for developers.\u003c/p\u003e\n\u003cp\u003eRaycast is a native Mac application with a significant focus on top-notch UI and interactions. We genuinely care about user experience, performance, privacy and ease of use. We had enough of dealing with slow and clunky tools. Raycast is our attempt to let you enjoy your daily workflows without all the distractions.\u003c/p\u003e\n\u003cp\u003eTerminals are outdated: Rich media elements aren't supported, ASCII characters are too limiting and commands are hard to discover. Raycast combines the benefits of a command line with those of a modern user interface. It's simple, responsive and extensible. At the core of this, is a rock-solid desktop client that handles plugins and connects to a store full of productivity tools. We need engineers that are eager to build a tool that improves their own day-to-day life to realise this vision with us.\u003c/p\u003e\n\u003cp\u003eWe're a fully remote company spread across Europe and looking for candidates in EU-friendly timezones. This position is for a full-time employment.\u003c/p\u003e\n\u003ch2\u003eIn this role you will...\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eBuild user-facing features in the core product.\u003c/strong\u003e You work on our macOS application which is our primary surface. You build new features that enrich the core user experience in the app and expand our library of custom and keyboard-driven UI components.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCo-own the product and work self-directed.\u003c/strong\u003e We're a small team of individual contributors. Everybody has autonomy and responsibility. You work on features from ideation over release to maintenance and shape the roadmap of the product.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSolve interesting technical and UX problems.\u003c/strong\u003e Raycast fits many tools into a single user interface. For this, you solve hard problems like optimistic updates, database indexing and standardized user interactions with like-minded team-mates.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eImprove performance and care about quality.\u003c/strong\u003e You dogfood your own features with our nighlty builds, respond to user feedback in our community and jump into the profiler to make every interaction feel snappy. You automate tedious tasks. At best, directly in Raycast.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWear many hats.\u003c/strong\u003e In such a small startup, we're all generalists. You might add a new page to our Vue.js website, set up an internal endpoint in our Node.js backend or write a blog post about a new feature.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYou will be a great fit if...\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're highly productive while writing quality code.\u003c/strong\u003e We release updates every 1-2 weeks. You can break down big projects in small deliverables. You care about the outcome and take a pragmatic approach to deliver it. You keep things simple and rather write a little bit more code than adopting a third-party dependency. You know when you want a code review or need to write tests.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're product-minded.\u003c/strong\u003e Raycast is designed to keep developers focused. You have a sense for great user experience and feel when something is off. You prefer polishing a feature instead of shipping soul-less pixels. You add analytics to reason about changes in the app and pro-actively iterate.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou put our users first.\u003c/strong\u003e Throughout Raycast you find many \u003ca href=\"https://twitter.com/raycastapp/status/1322188380403281921?s=21\"\u003elittle details\u003c/a\u003e. You pay attention to detail and provide our users a delightful experience. You can't stand bugs and don't shy away from user feedback.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're an empathetic communicator.\u003c/strong\u003e You treat technology as tradeoffs. You may be opinionated but you're not ideological. When disagreeing, you communicate thoughtfully your perspective and compromise when needed. You're thriving in a team environment and hold your colleagues accountable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eOur stack\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eSwift for our macOS app.\u003c/strong\u003e Everything is written in Swift using AppKit with Swift Packages. We don't use SwiftUI because it's too premature for rapid development. We rarely adopt third party dependencies. Some are GRDB for our database, Sentry for crash reporting, Nuke for image fetching and a few C libraries to crank up performance.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eJavaScript/TypeScript for everything on the web.\u003c/strong\u003e We use Vue.js with Gridsome for our website and deploy it with Vercel. Our backend is a simple Node.js app written with Express and hosted on Heroku.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eModern work tools for everything.\u003c/strong\u003e Linear for issue tracking, GitHub as source control, Sentry for error reporting, Segment and Amplitude for analytics, Slack for internal communication, Figma for pixels, Notion as knowledge base and a few others. As a team, we enjoy using CleanShot, Bear, Things and more Mac apps.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're at beginning of our next chapter.\u003c/strong\u003e You will join us at the \u003ca href=\"blog/hello-world/\"\u003eright time\u003c/a\u003e to have major impact on the future of the company. We released Raycast 1.0, established a friendly community and are jumping head first into building a platform for productivity tools.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're backed by great investors.\u003c/strong\u003e We're backed by \u003ca href=\"https://www.accel.com/noteworthy/giving-developers-superpowers-our-investment-in-raycast\"\u003eAccel\u003c/a\u003e, Y Combinator, Chapter One and angels such as Charlie Cheever (Co-Founder of Expo \u0026amp; Quora), Calvin French-Owen (Co-Founder of Segment), Zach Holman (Early GitHub engineer) and more.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're individual contributors at heart.\u003c/strong\u003e We value full ownership and responsibility, choose quality over quantity and put our users first. We're motivated by shipping truly great software.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe'll treat you well.\u003c/strong\u003e Get a competitive salary, equity and health insurance. Plus, we provide a monthly health benefit for a gym, pay for your coworking space, give you a MacBook Pro with 5K display and accessories and provide 25 days of paid-time off (PTO) plus all national holidays.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSend us an engaging message at \u003ca href=\"mailto:jobs+macos@raycast.com?subject=Software%20Engineer,%20macOS\"\u003ejobs@raycast.com\u003c/a\u003e with information you think is relevant. Tell us why you want to join us, what excites you about the problem we're solving and how you envision your role at Raycast.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDZSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--297c2bfd46b4351117543c66da10f02a2d65aac3/Raycast-Wordmark.png"},{"id":"1f925d62-ab2e-4700-b36b-767378fabc07","type":"Full Time","url":"https://jobs.github.com/positions/1f925d62-ab2e-4700-b36b-767378fabc07","created_at":"Wed Nov 25 16:13:02 UTC 2020","company":"Raycast","company_url":"https://raycast.com","location":"Remote, EU","title":"Software Engineer, Fullstack","description":"\u003ch2\u003eTL;DR\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a productivity tool for developers\u003c/li\u003e\n\u003cli\u003eSmall team that is light on processes\u003c/li\u003e\n\u003cli\u003eFully remote (EU-friendly timezones)\u003c/li\u003e\n\u003cli\u003eBacked by great investors (\u003ca href=\"https://www.ycombinator.com\"\u003eY Combinator\u003c/a\u003e, \u003ca href=\"https://www.accel.com/noteworthy/giving-developers-superpowers-our-investment-in-raycast\"\u003eAccel\u003c/a\u003e, \u003ca href=\"https://chapterone.com\"\u003eChapter One\u003c/a\u003e and top angels)\u003c/li\u003e\n\u003cli\u003eModern perks (MacBook Pro with 5k display, co-working space, monthly health benefit, ...)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDescription\u003c/h2\u003e\n\u003cp\u003eRaycast makes it simple, fast and delightful to control your tools. We're looking for a Software Engineer to join our small team to build, own and scale the distribution of Raycast extensions via a store that developers around the world can contribute to.\u003c/p\u003e\n\u003cp\u003eRaycast is a native Mac application with a significant focus on top-notch UI and interactions. We genuinely care about user experience, performance, privacy and ease of use. We had enough of dealing with slow and clunky tools. Raycast is our attempt to let you enjoy your daily workflows without all the distractions.\u003c/p\u003e\n\u003cp\u003eWhen Apple announced the App Store in 2008, the distribution of software changed over night. Suddenly, developers could reach millions of customers. We believe it's about time to change how developers discover and consume productivity tools. At the center of this, is a store full of Raycast extensions that people can share and manage or discover new ones from others. We need hungry engineers that architect and build this store to revolutionise how developers experience productivity tools with us.\u003c/p\u003e\n\u003cp\u003eWe're a fully remote company spread across Europe and looking for candidates in EU-friendly timezones. This position is for a full-time employment.\u003c/p\u003e\n\u003ch3\u003eIn this role you will...\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eBuild our extension store from scratch.\u003c/strong\u003e You set up the database and API for the backend and implement the design of the frontend. You align the communication and distribution with the macOS client.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCo-own the product and work self-directed.\u003c/strong\u003e We're a small team of individual contributors. Everybody has autonomy and responsibility. You work on features from ideation over release to maintenance and shape the roadmap of the product.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eShape the experience for contributors.\u003c/strong\u003e The store is one piece of the puzzle. You generate ideas about how developers should add and maintain extensions. You optimise for ease-of-use for producers and consumers.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eImprove performance and care about quality.\u003c/strong\u003e You dogfood your own features with our nightly builds, respond to user feedback in our community and jump into the profiler to make every interaction feel snappy. You automate tedious tasks. At best, directly in Raycast.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWear many hats.\u003c/strong\u003e In a small startup, we're all generalists. You might add a new page to our Vue.js website, integrate endpoints into our macOS client or write a blog post about a new feature.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eYou will be a great fit if...\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're highly productive while writing quality code.\u003c/strong\u003e We release updates every 1-2 weeks. You can break down big projects in small deliverables. You care about the outcome and take a pragmatic approach to deliver it. You keep things simple and rather write more code than adopting a third-party dependency. You know when you want a code review or need to write tests.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're product-minded.\u003c/strong\u003e You have a sense for great user experience and feel when something is off. You prefer polishing a feature instead of shipping soul-less pixels. You add analytics to reason about changes in the app and pro-actively iterate.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou have a track-record of great web apps.\u003c/strong\u003e You've seen software projects succeed and fail and bring in proven concepts to ship software from day one.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou put our users first.\u003c/strong\u003e Throughout Raycast you find many \u003ca href=\"https://twitter.com/raycastapp/status/1322188380403281921?s=21\"\u003elittle details\u003c/a\u003e. You pay attention to detail and provide our users a delightful experience. You can't stand bugs and don't shy away from user feedback.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou're an empathetic communicator.\u003c/strong\u003e You treat technology as tradeoffs. You may be opinionated but you're not ideological. When disagreeing, you communicate thoughtfully your perspective and compromise when needed. You're thriving in a team environment and hold your colleagues accountable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eOur stack\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eJavaScript/TypeScript for the web.\u003c/strong\u003e Most of our web development happend on our marketing website. We're open to adopt new technologies for the store where applicable. For now, we use Vue.js with Gridsome for our website and deploy it with Vercel. Our middleware is a simple Node.js app written with Express and hosted on Heroku.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSwift for our macOS app.\u003c/strong\u003e Everything is written in Swift using AppKit with Swift Packages. We don't use SwiftUI because it's too premature for rapid development. We rarely adopt third party dependencies. Some are GRDB for our database, Sentry for crash reporting, Nuke for image fetching and a few C libraries to crank up performance.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eModern work tools for everything.\u003c/strong\u003e Linear for issue tracking, GitHub as source control, Sentry for error reporting, Segment and Amplitude for analytics, Slack for internal communication, Figma for pixels, Notion as knowledge base and a few others. As a team, we enjoy using CleanShot, Bear, Things and more Mac apps.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're at beginning of our next chapter.\u003c/strong\u003e You will join us at the \u003ca href=\"blog/hello-world/\"\u003eright time\u003c/a\u003e to have major impact on the future of the company. We released Raycast 1.0, established a friendly community and are jumping head first into building a platform for productivity tools.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're backed by great investors.\u003c/strong\u003e We're backed by \u003ca href=\"https://www.accel.com/noteworthy/giving-developers-superpowers-our-investment-in-raycast\"\u003eAccel\u003c/a\u003e, Y Combinator, Chapter One and angels such as Charlie Cheever (Co-Founder of Expo \u0026amp; Quora), Calvin French-Owen (Co-Founder of Segment), Zach Holman (Early GitHub engineer) and more.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe're individual contributors at heart.\u003c/strong\u003e We value full ownership and responsibility, choose quality over quantity and put our users first. We're motivated by shipping truly great software.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWe'll treat you well.\u003c/strong\u003e Get a competitive salary, equity and health insurance. Plus, we provide a monthly health benefit for a gym, pay for your coworking space, give you a MacBook Pro with 5K display and accessories and provide 25 days of paid-time off (PTO) plus all national holidays.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSend us an engaging message at \u003ca href=\"mailto:jobs+fullstack@raycast.com?subject=Software%20Engineer,%20Fullstack\"\u003ejobs@raycast.com\u003c/a\u003e with information you think is relevant. Tell us why you want to join us, what excites you about the problem we're solving and how you envision your role at Raycast.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--39ef481200e53596de6f11f8e65c1468a230f536/Raycast-Wordmark.png"},{"id":"1e68cdbf-b0ce-40e6-8a83-3124bbb69edb","type":"Full Time","url":"https://jobs.github.com/positions/1e68cdbf-b0ce-40e6-8a83-3124bbb69edb","created_at":"Wed Nov 25 15:59:06 UTC 2020","company":"api.video","company_url":"https://jobs.api.video/","location":"Bordeaux, NAQ, FR","title":"[CDI] Full Stack Developer","description":"\u003cp\u003e\u003cstrong\u003e[CDI] Full Stack Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://api.video/\"\u003eapi.video\u003c/a\u003e connects people through their cameras. Join us to build the first worldwide video backbone!\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe are an \u003cstrong\u003eAPI-first platform to manage online video\u003c/strong\u003e and our goal is to become a new standard, such as Stripe for the payments, Twilio for text and VOIP or Sendgrid for email.\u003c/li\u003e\n\u003cli\u003eWe are building our own \u003cstrong\u003eEDGE infrastructure\u003c/strong\u003e to provide unprecedented performances on the market.\u003c/li\u003e\n\u003cli\u003eWe have raised a \u003ca href=\"https://techcrunch.com/2020/06/24/api-video/\"\u003e\u003cstrong\u003e$5.5M Seed Round\u003c/strong\u003e\u003c/a\u003e in June 2020 from Blossom Capital, Kima Ventures and some \u003ca href=\"https://www.crunchbase.com/funding_round/api-video-angel--81c5d31d\"\u003e\u003cstrong\u003eincredible Angels\u003c/strong\u003e\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBy joining us, you will work in an international environment, addressing challenges that will impact millions of people.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will join the Growth team composed of the Product Designer, the Growth Manager, 2 Developer Evangelists and the Marketing Manager.\nYou will be the very first Developer Full Stack, so you will manage all the process and documentation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour missions\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou lead the new back office development.\u003c/li\u003e\n\u003cli\u003eYou develop, maintain and modify dedicated tools and landing pages to help our developer community.\u003c/li\u003e\n\u003cli\u003eYou maintain and improve the api.video website.\u003c/li\u003e\n\u003cli\u003eYou proceed to tests to ensure compliance for all developments and you produce a detailed documentation.\u003c/li\u003e\n\u003cli\u003eYou create excellent interactions from designs, writing reusable content modules and maintainability of the code.\u003c/li\u003e\n\u003cli\u003eYou create usable, responsive and interactive interfaces across multiple devices.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e+4 years of experience as a Full Stack Developer.\u003c/li\u003e\n\u003cli\u003eDeep knowledge in Javascript/Typescript, CSS3, Sass/SCSS, HTML5 and NodeJS ecosystem.\u003c/li\u003e\n\u003cli\u003eKnowledge of basic SEO principles.\u003c/li\u003e\n\u003cli\u003eExperience in PHP development and SQL.\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of browser troubleshooting and debugging practices and techniques.\u003c/li\u003e\n\u003cli\u003eKnowledge in API integration is a plus.\u003c/li\u003e\n\u003cli\u003eKnowledge of DatoCMS (optional).\u003c/li\u003e\n\u003cli\u003eEnglish proficiency.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePackage\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive pay and equity.\u003c/li\u003e\n\u003cli\u003eAnnual Bonus.\u003c/li\u003e\n\u003cli\u003eCovered medical, dental, and vision benefits.\u003c/li\u003e\n\u003cli\u003eCompany Provided Equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe position is based in Bordeaux, France.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAre you up for the challenge?\u003c/strong\u003e\nApply now via the \u003ca href=\"https://ltpx.nl/DD4ACw6\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eapi.video is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/wbvQaAr\"\u003eKlik hier om te solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac1fd48043af7c01748b5f1159a81dfd4f3faa6b/api.video%20logo.png"},{"id":"77208332-72c3-4c82-8ee8-59fe3f1535f0","type":"Full Time","url":"https://jobs.github.com/positions/77208332-72c3-4c82-8ee8-59fe3f1535f0","created_at":"Wed Nov 25 12:36:23 UTC 2020","company":"Humanitec","company_url":"https://humanitec.com/","location":"Berlin","title":"Principal Backend Engineer","description":"\u003cp\u003e\u003cstrong\u003eThe product\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re building the next generation of dev tools to support teams in building and running apps on Kubernetes. This is a new category of tooling called “Internal Developer Platforms”. Pioneered for some time in companies such as Spotify, Github, Airbnb, and others we are providing the fastest way for teams to build their own Internal Developer Platforms. Internal Developer Platforms provide a developer experience as simple as Heroku but on top of the tech and tools the team uses already. They allow ops teams to stay in control while enabling developers to self-serve the tech they need. Do you want to spin up an environment to do some quick testing? No problem! Need to clone Production to troubleshoot an issue without risking more problems? Easy! Need to stand up a new database for your service but ops is busy? Piece of cake! We have our first version out the door and have happy customers using the product in production.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe team\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe majority of our company are engineers. Our management team is made up of Ex-Google, Ex-Mckinsey, and serial entrepreneurs. We’re backed by experts in the DevOps space such as Sohaib Abbasi (Oracle, Redhat, New Relic) and Mirco Novakovic (Instana, recently acquired by IBM).\u003c/p\u003e\n\u003cp\u003eWe're looking for people who could land a job at the likes of Google, Amazon, or Microsoft - but prefer the excitement, challenge, and daring of being part of a disruptive startup. We focus on your talents and personality - your background, origin, or gender will never make a difference to us.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhom are we looking for?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking to hire remote principal engineers\u003c/strong\u003e as individual contributors to design, develop, test, deploy, maintain, and improve Humanitec. You should have significant professional experience in building highly scalable distributed systems. CS degree and experience in dev productivity tools are a plus. Languages: predominantly Go with a few Python services sprinkled in. Everything is on Kubernetes. We pay top 5% in the market, stocks are part of the package. Work is fully remote and we work exclusively with senior engineers in small, lean, and self-organized teams. We currently prefer time-zones UTC-1 to UTC+3.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are the main responsibilities of the role?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, develop, test, deploy, maintain, and improve the software.\u003c/li\u003e\n\u003cli\u003eLead designs of major software components, systems, and features.\u003c/li\u003e\n\u003cli\u003eBuild our platforms, systems, and infrastructure using your background in distributed systems, API design, and Kubernetes.\u003c/li\u003e\n\u003cli\u003eMentor and train other team members on design techniques and coding standards.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAre you a fit?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Engineering or Computer Science or equivalent practical experience.\u003c/li\u003e\n\u003cli\u003e6 years of software development experience.\u003c/li\u003e\n\u003cli\u003eSoftware development experience in C/C++, C#, Java, Python, Go, or similar.\u003c/li\u003e\n\u003cli\u003eExperience architecting and developing solutions to ambiguous problems with significant impact.\u003c/li\u003e\n\u003cli\u003eExperience with infrastructure technologies, architecting/developing distributed systems, API design, and Kubernetes.\u003c/li\u003e\n\u003cli\u003eExperience with how DevOps tools work under the hood (CI pipelines, Terraform, Application Performance Management (e.g. DataDog), etc.).\u003c/li\u003e\n\u003cli\u003eRemote \u0026amp; work from a timezone UTC-1 to UTC+3 (Berlin time +/- 2 hours).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/c60250d56f25cc8f5c48347bcf36eb2cedb699a7/68747470733a2f2f742e676f686972696e672e636f6d2f682f37336636636231383961626131363538656463663330373134343538643635653631303038643461376166333263636535396366353339666365373265666637\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/03b45e81dfc90036a91ed5cc1a35cdcebe95ea05875f645f1c1740f36062e94d\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaENSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0f2c5f758ee5ab90766ed5628b31ae14731298c9/Humanitec.png"},{"id":"c7b8f1e2-57bc-4af7-846e-194063bb5862","type":"Full Time","url":"https://jobs.github.com/positions/c7b8f1e2-57bc-4af7-846e-194063bb5862","created_at":"Tue Nov 24 21:08:25 UTC 2020","company":"Oregon State University - Ecampus","company_url":"https://oregonstate.edu/","location":"Corvallis, OR","title":"Analyst Programmer","description":"\u003cp\u003eIf you would like to be a part of a community that enjoys a beautiful 400-acre campus with park-like settings, supports world-renowned research, teaching, and outreach, or assists students to become successful citizens, consider a career with Oregon State University.\nOregon State University Ecampus is seeking to fill one full-time Analyst Programmer, competency level 3, position for Ecampus at Oregon State University (OSU).\u003c/p\u003e\n\u003cp\u003eOregon State Ecampus is a growing, innovative, and collaborative organization with a commitment to providing high-quality online degrees and programs. Ecampus makes OSU’s exceptional learning experiences available to students throughout Oregon and around the world.\nThe full-stack developer (analyst programmer, competency level 3) provides programming and multimedia support for OSU Ecampus’ course needs. The multimedia team is part of the Course Development and Training (CDT) unit within the division of Ecampus. The division is a fast-growing, entrepreneurial organization with a commitment to providing access to Oregon State University’s programs of excellence. Ecampus includes Oregon State Ecampus (online degrees), Open Educational Resources (open access online resources), and the Ecampus Research unit (conducts original research).\nThe CDT unit provides expertise and support for the development of online and hybrid courses, including instructional design services, innovative multimedia development, and faculty development programming and support. This position reports directly to the assistant director of CDT.\nWithin the CDT team, the full-stack developer will collaborate closely with other programmers on the multimedia web development team including instructional designers and faculty course developers to ensure high-quality projects are produced. This position works closely with faculty and administrators to assess how multimedia technologies can augment students’ abilities to meet course learning outcomes. Builds long term positive relationships and collaborates with faculty, instructors, and content experts to identify needs.\nOregon State University and OSU Ecampus maintain and enhance a collaborative and inclusive community that is dedicated to equity and equal opportunity. All employees of this division are responsible for ensuring that these commitments are achieved. This position directly contributes to those goals by designing learning environments that are inclusive, accessible, and follow the best practices of Universal Design for Learning.\u003c/p\u003e\n\u003cp\u003ePosition duties\n35% Application Design \u0026amp; Development\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResponsible for reviewing code pushes from student workers on the team for quality and accessibility.\u003c/li\u003e\n\u003cli\u003eDesigns, develops, and maintains scalable applications created in React.js.\u003c/li\u003e\n\u003cli\u003eDevelop front-end projects and components using JavaScript ES6 and Typescript.\u003c/li\u003e\n\u003cli\u003eDevelop back-end solutions (API’s and microservices) using Node.js and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eResponds to front-end/browser compatibility issues. Develops applications that have responsive designs and adhere to WCAG 2.1 accessibility standards.\u003c/li\u003e\n\u003cli\u003eCollaborates with other developers to design the visual interface for custom projects.\u003c/li\u003e\n\u003cli\u003eResponsible for designing, writing and implementing testing processes (unit and end-to-end tests).\u003c/li\u003e\n\u003cli\u003eResponsible for documentation of any scripts, functions, tools, or integrations developed.\n35% – Project Management\u003c/li\u003e\n\u003cli\u003eProvide front-end development oversight, guidance, lead work to student workers.\u003c/li\u003e\n\u003cli\u003eMaintain a Kanban board for project tracking.\u003c/li\u003e\n\u003cli\u003eAttend meetings with project stakeholder to gather project requirements and share project progression.\u003c/li\u003e\n\u003cli\u003eGenerate progress reports for the team lead.\u003c/li\u003e\n\u003cli\u003eCommunicates progress and reviews web applications that have been developed for online courses with content experts and CDT team members involved in the project.\n10% Troubleshooting and Support\u003c/li\u003e\n\u003cli\u003eHandles incoming support requests turning them into actionable items and communicates with necessary parties to get the issues resolved.\u003c/li\u003e\n\u003cli\u003eTroubleshoots web applications to resolve issues and diagnose technical problems that affect the work of OSU Ecampus’ clients/users.\n10% Research and Assessment\u003c/li\u003e\n\u003cli\u003eResearches and develops methods and technology that leverage media in improving instruction, knowledge transfer, and learner retention of information.\u003c/li\u003e\n\u003cli\u003eIdentifies emerging technologies and resources that can be used to enhance and improve the quality and completion rate of media projects.\u003c/li\u003e\n\u003cli\u003eAssesses and evaluates the effectiveness of technological components and products. Researches and suggests improvements to current processes and tools.\n5% – Professional development and service\u003c/li\u003e\n\u003cli\u003eServes as a member of OSU Ecampus teams as assigned. Provides service to OSU by working on departmental, division, university, regional and national committees, and projects, serving as a representative of OSU Ecampus and the CDT team.\u003c/li\u003e\n\u003cli\u003eAttends meetings, participates in team decision making, implements solutions to team challenges as a member of the CDT multimedia team. Service may include other duties as assigned to support and provide back-up for the CDT team.\u003c/li\u003e\n\u003cli\u003eAttends professional workshops and meetings, sharing knowledge and networking with other professionals. Represents OSU Ecampus at forums, workshops, trade shows, customer meetings, and other opportunities allowing interaction with constituents and clients. Participates in and provides technical cross-training.\n5% – Security\u003c/li\u003e\n\u003cli\u003eEnsures that all projects that are undertaken meet security and data integrity as established by OSU Ecampus and OSU IT. Implements processes to ensure projects meet these standards.\u003c/li\u003e\n\u003cli\u003eAdvises unit leadership regarding security for any multimedia team digital assets or projects that are undertaken. Is aware of and provides a preliminary review of any system or software being used on a project that handles user data.\u003c/li\u003e\n\u003cli\u003eMaintains appropriate documentation related to data security regarding the projects completed.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMinimum (required) qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis classification requires a basic foundation of knowledge and skills in systems analysis and related programming support functions generally obtained by a bachelor’s degree in computer science, or an equivalent amount of training and applied experience.\u003c/li\u003e\n\u003cli\u003eDemonstrated skill in front-end web development (JavaScript, CSS3, HTML5)\u003c/li\u003e\n\u003cli\u003eDemonstrated skill in React and Redux.\u003c/li\u003e\n\u003cli\u003eDemonstrated skill in backend development using Node.js\u003c/li\u003e\n\u003cli\u003eExcellent written and oral communication skills\u003c/li\u003e\n\u003cli\u003eExperience developing in a collaborative team environment\u003c/li\u003e\n\u003cli\u003eA demonstrable commitment to promoting and enhancing diversity\u003c/li\u003e\n\u003cli\u003eThis position is designated as a critical or security-sensitive position; therefore, the incumbent must successfully complete a criminal history check and be determined to be position qualified as per OSU Standard 576-055-0000 et seq. Incumbents are required to self-report convictions and those in youth programs may have additional criminal history checks every 24 months.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Serverless (Amazon Web Services, Azure, Google Cloud)\u003c/li\u003e\n\u003cli\u003eExperience working with NoSQL databases (MongoDB, DynamoDB, etc.)\u003c/li\u003e\n\u003cli\u003eExperience with Adobe Creative Suite (Photoshop, Illustrator)\u003c/li\u003e\n\u003cli\u003eExperience with source control/version control systems (such as Git)\u003c/li\u003e\n\u003cli\u003eExperience with designing responsive and accessible web applications\u003c/li\u003e\n\u003cli\u003eExperience integrating with APIs (REST)\u003c/li\u003e\n\u003cli\u003eExperience with Agile (scrum, kanban)\u003c/li\u003e\n\u003cli\u003eExperience working with a diverse group of people/teams.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOSU seeks diversity as a source of enrichment for our university community. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApplication link: \u003ca href=\"http://jobs.oregonstate.edu/postings/95971\"\u003ehttp://jobs.oregonstate.edu/postings/95971\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eDeadline 12/14/20\u003c/p\u003e\n\u003cp\u003eApplications will be reviewed based on the information submitted on the employment profile with education and work history along with any other requested documentation i.e. Posting specific question responses, transcripts, etc. Your profile MUST clearly show how you meet the minimum/required qualifications for the position. Resumes are NOT accepted at the application stage for classified staff positions.\u003c/p\u003e\n\u003cp\u003eFor additional information please contact: Danielle Franklin at \u003ca href=\"mailto:Danielle.Franklin@oregonstate.edu\"\u003eDanielle.Franklin@oregonstate.edu\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3FSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31fae067adc8ce3ad7abb4bbd1b72f3a7fe25ff3/OSU_vertical_1C_B.png"},{"id":"954ab75e-a886-49cd-9c75-33013e4b048d","type":"Full Time","url":"https://jobs.github.com/positions/954ab75e-a886-49cd-9c75-33013e4b048d","created_at":"Tue Nov 24 19:04:39 UTC 2020","company":"7 Chord","company_url":"http://http","location":"New York","title":"Machine Learning Engineer - Trading","description":"\u003cp\u003eThis is an exceptional opportunity for a high caliber MSc graduate or an experienced Machine Learning Engineer to join a successful revenue-generating capital markets tech firm with a ground-breaking predictive pricing product. You will work with some of the brightest minds in data science to find innovative solutions for storing, accessing, combining and synthesizing real-time data.\u003c/p\u003e\n\u003cp\u003eAbout Us:\n7 Chord is an award-winning FinTech start-up in NYC. BondDroid, our proprietary AI system, empowers bond traders and investors with predictive pricing and trading signals.  The firm was founded by market veterans and renowned machine learning researchers. We are backed by strategic investors and an elite group of former Wall Street executives.\u003c/p\u003e\n\u003cp\u003eTechstars Class of 2017 (1% acceptance rate)\nMarkets Choice Award for “Excellence in AI” 2019\nOn the list of “Most Innovative FinTech startups of 2019” by Harrington Starr\n2020 and 2019 Benzinga Global Fintech Awards List (“Best in AI” category)\nFinTechSandbox Alumni and Data Provider\u003c/p\u003e\n\u003cp\u003eWhat You'll Do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with data scientists to design, develop, and implement scalable ML solutions.\u003c/li\u003e\n\u003cli\u003eEmphasis will be on deploying real-time ML solutions in a production environment using cutting edge technologies with a focus on achieving scalable, low latency, optimized solutions.\u003c/li\u003e\n\u003cli\u003eWork with data scientists to develop new techniques to deal with ML solutions built on streaming data and solve problems inherent in financial data, including low signal-to-noise ratios and non-stationarity.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of professional experience in an enterprise-level environment.\u003c/li\u003e\n\u003cli\u003eMSc in Computer Science preferred.\u003c/li\u003e\n\u003cli\u003eExperience handling large volumes of real-time / streaming data, preferably in a financial domain.\u003c/li\u003e\n\u003cli\u003ePython 3 and PostgreSQL experience required.\u003c/li\u003e\n\u003cli\u003eExperience with scikit-learn required, bonus points for other popular ML libraries.\u003c/li\u003e\n\u003cli\u003eJava and MongoDB experience preferred but not required.\u003c/li\u003e\n\u003cli\u003eFamiliarity with messaging technologies (RabbitMQ, Kafka or Kinesis) and distributed cloud computing.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eComp, Benefits, Perks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary. Equity. Enormous growth potential.\u003c/li\u003e\n\u003cli\u003eSubsidized health insurance, transportation benefit and 401K.\u003c/li\u003e\n\u003cli\u003eContinuing education stipend.\u003c/li\u003e\n\u003cli\u003eWork from home in 2020 and 2021. Once and if we go back to the office, free state-of-the-art gym and wellness center on premises. Access to the open private waterfront space, half-court basketball court, outdoor terraces, training and conference facilities, cafeteria and lounge.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease send your resume, including your linkedin and/or github profiles to: \u003ca href=\"mailto:careers@7-chord.com\"\u003ecareers@7-chord.com\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your resume, including your linkedin and/or github profiles to: \u003ca href=\"mailto:careers@7-chord.com\"\u003ecareers@7-chord.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2lSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5c099f86472dd17b69407087f86e65fc32569b00/Copy%20of%20logo-7chord_symbol_trans-02.png"},{"id":"78695122-a4ea-4d86-95c0-c14c0ab0d77d","type":"Full Time","url":"https://jobs.github.com/positions/78695122-a4ea-4d86-95c0-c14c0ab0d77d","created_at":"Mon Nov 23 16:01:49 UTC 2020","company":"Pinguin AG","company_url":"http://pinguin.ag/","location":"Berlin","title":"Frontend Developer (m/f/d)","description":"\u003cp\u003eWhat is key to every business success? It is keeping focus on what you are best at and leave your competitors behind. Many freelancers and small business owners are forced to do everything themselves resulting in loss of focus and missed business opportunities. They can’t use their time efficiently because they get distracted by incoming calls, messages and mails or miss on opportunities because they were not able to answer that one call that would have been the next big deal.\u003c/p\u003e\n\u003cp\u003eOur powerful and constantly developing software as a service communication platform is for more than 20 years a catalyst for success in that our customers never miss an opportunity while being able to maintain focus and concentrate on their core activities.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCollaborating with our designers, you will create interfaces that make it fun and satisfying to interact with our services. Communication with the back-end is done through a REST-API, which you will help to extend. You will build new web-apps for our customers using JavaScript, CSS3 and HTML5 by leveraging modern technologies like Angular or NativeScript. Great user experience is key.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are fluent in web technologies like HTML, CSS3 and JavaScript\n. Knowledge of Angular and Nativescript is an asset\u003c/li\u003e\n\u003cli\u003eYou have multiple years of working experience in frontend development\u003c/li\u003e\n\u003cli\u003eYou are able to use REST-based backend services (if you can do it in Java it's a plus)\u003c/li\u003e\n\u003cli\u003eYou think pragmatically and constantly look for the best solution\u003c/li\u003e\n\u003cli\u003eYou feel responsibility for our products and have the willingness to participate in architectural discussions and decisions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChoose what's best for your: MacBook or PC?\u003c/li\u003e\n\u003cli\u003eRide a bike or a train: we provide a bike or public transport ticket\u003c/li\u003e\n\u003cli\u003eStay healthy and relaxed: we support Urban Sports Club\u003c/li\u003e\n\u003cli\u003eBecome a Foam master or Bartender: enjoy the best coffee machine and beer from tap in our office\u003c/li\u003e\n\u003cli\u003eLevel up your skills: we will get you eye-opening books\u003c/li\u003e\n\u003cli\u003eTake a course: we will support your hunger for education\u003c/li\u003e\n\u003cli\u003eYou need some holidays? 28 days for everyone\u003c/li\u003e\n\u003cli\u003eYou don´t smoke? Get one extra day off\u003c/li\u003e\n\u003cli\u003eYou have hobbies and a family? Great. We have core hours to maintain flexibility\u003c/li\u003e\n\u003cli\u003eSounds terrifying? Bummer! We’re sorry to hear that.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSounds terrific? Great! Get in touch.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe at Pinguin are fostering diversity and are committed to create teams with a broad variety of backgrounds, experiences, perspectives and skills. All decisions about interviews, offers and employment are based on expertise, merit and business need.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://pinguin.join.com/jobs/1573899-frontend-developer-m-f-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=frontend%2Bdeveloper%2Bm%2Bf%2Bd\"\u003ehttps://pinguin.join.com/jobs/1573899-frontend-developer-m-f-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=frontend%2Bdeveloper%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnlRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2a2af7404e5eebb3737fa75ec0286f3b86746248/pinguin.png"},{"id":"11db89a9-5b43-4deb-9780-81b3deb46005","type":"Full Time","url":"https://jobs.github.com/positions/11db89a9-5b43-4deb-9780-81b3deb46005","created_at":"Mon Nov 23 13:48:17 UTC 2020","company":"SoundCloud","company_url":"https://soundcloud.com/discover","location":"Berlin","title":"Lead Data Science (f/m/d)","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for an impact-driven Lead Data Scientist to solve and help others solve exciting problems across the SoundCloud product using Machine Learning and other Data Science tools. You will work closely with other data scientists and engineers to find opportunities, build, tune, instrument, and evaluate data science models.\u003c/p\u003e\n\u003cp\u003eOur Data Scientists work on a wide range of products and problems having direct impact on our millions of daily active users. We want people that come equipped with an open mind, creativity and a get-it-done attitude.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn this role you will be responsible for leading the efforts to build data products and internal solutions for some of the hardest problems at SoundCloud. You will see projects through from start to finish performing research, prototyping solutions, production deployment at scale and A/B testing to validate your solutions. We love specialists with deep experience, and we expect to use that experience alongside a Data Scientist’s ability to be general and tackle a wide range of problem areas.\u003c/p\u003e\n\u003cp\u003eSome projects you might work on include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, adapt, combine, and choose data science methodology (statistics, machine learning, optimization, experimentation) to address complex problems.\u003c/li\u003e\n\u003cli\u003eEvaluate and validate correctness of data models and theoretical approaches. Assess and validate performance of models to meet business objectives.\u003c/li\u003e\n\u003cli\u003eDeepen in personalized user journeys to gain a comprehensive understanding of user behavior, develop targeted advertising, and improve digital experiences.\u003c/li\u003e\n\u003cli\u003eProvide guidance on how to improve the efficiency and effectiveness of current solutions with changes that affect the bottom line of the organization\u003c/li\u003e\n\u003cli\u003eCommunicate complex information to a wide and non technical audience. Determine data requirements and performance metrics to measure company wide business objectives.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are a Lead Data Scientist with a curious analytical mindset, experience with software engineering, and a track record of shipping solutions at large scale. You have a broad toolkit that spans languages and runtimes, and you can get up-to-speed with new tech stacks quickly. You enjoy working cross-functional with Engineers, Product Managers and peer Data Scientists. You have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a Ph.D. or M.Sc. in a quantitative field (Statistics, Machine Learning, AI, Computer Science, Physics, Mathematics, etc.) or demonstrated industry experience productionizing machine learning algorithms.\u003c/li\u003e\n\u003cli\u003eA minimum of 10 years of experience in a full-time industry position (not academic).\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with and solid knowledge of cloud technologies (GCP, AWS).\u003c/li\u003e\n\u003cli\u003eExperience of software engineering techniques including version control, continuous integration, unit testing.\u003c/li\u003e\n\u003cli\u003eA deep understanding of the lifecycle of a Data Science project, with experience in research, solution development, tuning and inspecting models, etc.\u003c/li\u003e\n\u003cli\u003eExperienced wrangling very large datasets by writing and maintaining data processing pipelines.\u003c/li\u003e\n\u003cli\u003eStrong engineering background, with experience with Scala, Python or similar languages that are used to ship production models and systems.\u003c/li\u003e\n\u003cli\u003eYou have solid analytical capabilities; you know not just how to solve problems with machine learning but also where and when.\u003c/li\u003e\n\u003cli\u003eAn ability to tell a story about data, to explore and reveal patterns, and to communicate to stakeholders about your discoveries and hypothesis.\u003c/li\u003e\n\u003cli\u003eWorked in cross-functional teams and are able to work in multiple parts of a tech stack.\u003c/li\u003e\n\u003cli\u003eYou value the soft-side of applied research (e.g. communication, mentorship, team-work).\u003c/li\u003e\n\u003cli\u003eYou are excited by the opportunity to directly impact the daily experience and happiness of millions of people around the world.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDiversity at SoundCloud\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.*\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English.\u003c/li\u003e\n\u003cli\u003eWe have a flexible, friendly and inclusive office environment in Mitte\u003c/li\u003e\n\u003cli\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/li\u003e\n\u003cli\u003eYou can contribute to our Engineering Blog post.\u003c/li\u003e\n\u003cli\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\nInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/li\u003e\n\u003cli\u003eWe offer free German courses at beginning, intermediate and advanced.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4902447002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4902447002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmFRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1adfb21862bf2a044a6e1f14dc0c5260b5c0e581/main@2x.png"},{"id":"00bcd48b-d062-4db7-9971-ea18ec6c563c","type":"Full Time","url":"https://jobs.github.com/positions/00bcd48b-d062-4db7-9971-ea18ec6c563c","created_at":"Mon Nov 23 13:45:19 UTC 2020","company":"SoundCloud","company_url":"https://soundcloud.com/discover","location":"Berlin","title":"Data Architect (f/m/d)","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced data architect to help us build the next generation of ML-powered data delivery systems that will allow us to manage and expose engaging experiences on SoundCloud by optimising predictive performance while serving hundreds of millions of users.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn this role, you will be responsible for the overall architecture of our production data delivery as well as for engineering practices to ensure the stability, compliance, reliability and timeliness of our systems. Daily, you will be mentoring engineers as well as collaborating with other technical leaders across the organisation, contributing to architecture decisions and solving cross-functional technical problems.\u003c/p\u003e\n\u003cp\u003eYou will be overarching all the stages of the delivery from event logging, data preparation, identification of relevant metrics for production-readiness, scalable inference, and feature stores. You will be in charge of implementing best practices to improve the overall machine learning infrastructure and unleash modelling and evaluation strategy to find patterns and predict unseen instances.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou have significant experience in Machine Learning engineering and a deep passion for data processing infrastructure. With a problem-solving mindset, you have architected and built data delivery systems at scale, applying data-mesh principles.\u003c/p\u003e\n\u003cp\u003eYou have a pragmatic, results-oriented approach to application architecture and are excited to work in all areas of the analytics and the cloud stack. In this role, are expected to acquire a deep technical understanding of our products; execute a solution development roadmap; as well as provide mentorship.\u003c/p\u003e\n\u003cp\u003eFinally, you have a proven record of success coordinating with other technical leaders in your organisation, explaining your technical vision and strategy and creating consensus around it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpertise in the main components of continuous data delivery: project set up, design of data pipelines, modelling (selecting, training and debugging) and serving (testing, deploying, monitoring and maintaining).\u003c/li\u003e\n\u003cli\u003eProven track record of implementing machine-learning solutions and statistical frameworks.\u003c/li\u003e\n\u003cli\u003eStrong engineering background, with experience with Scala, Python, SparkML, Apache Beam, - TensorFlow or similar frameworks used to ship production models and systems.\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with and solid knowledge of cloud platforms, preferably including GCP.\u003c/li\u003e\n\u003cli\u003eFamiliarity with common approaches used in practical applications of machine learning such as pattern recognition, text classification, time series analysis, recommender systems, dimensionality reduction, and feature engineering.\u003c/li\u003e\n\u003cli\u003ePerformed data modelling assessments and provided recommendations to correct data modelling deficiencies, including improvements to the underlined data design.\u003c/li\u003e\n\u003cli\u003eIterative training and evaluation of production machine learning delivery systems from baseline to optimization.\u003c/li\u003e\n\u003cli\u003eKnowledge of interpretable models and observable and attributable metrics.\u003c/li\u003e\n\u003cli\u003eYou excel in the human aspects of applied research (e.g. communication, empathy, mentorship, team-work).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Diversity at SoundCloud\u003c/p\u003e\n\u003cp\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.*\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English.\u003c/li\u003e\n\u003cli\u003eWe have a flexible, friendly and inclusive office environment in Mitte\u003c/li\u003e\n\u003cli\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/li\u003e\n\u003cli\u003eYou can contribute to our Engineering Blog post.\u003c/li\u003e\n\u003cli\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\u003c/li\u003e\n\u003cli\u003eInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/li\u003e\n\u003cli\u003eWe offer free German courses at beginning, intermediate and advanced.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4948620002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4948620002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8fb3804aec1982768d4fff382a9ba431fa5b8c3b/main@2x.png"},{"id":"d92fc65c-68f6-431a-b537-85d6048d9241","type":"Full Time","url":"https://jobs.github.com/positions/d92fc65c-68f6-431a-b537-85d6048d9241","created_at":"Mon Nov 23 12:19:07 UTC 2020","company":"Integrationsbolaget","company_url":"https://www.integrationsbolaget.se/","location":"Örebro","title":"Lösningsarkitekt till Integrationsbolaget","description":"\u003cp\u003e\u003cem\u003e\"Gemenskap och engagemang! Alla som jobbar på Integrationsbolaget är engagerade i sina uppdrag och vill alltid göra sitt yttersta. Vi värdesätter kvalitet och relationen med våra kunder – vilket jag tycker är viktigt. Det finns också en samarbetsvilja och gemenskap mellan oss kollegor, det är aldrig svårt att be om hjälp\". - Sara Larsson, Service Manager\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOm tjänsten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget är ett specialiserat konsultföretag med expertkunskaper inom systemintegration på ledande teknologier i molnet eller on-premises. De grundades 2008 och har idag kontor i Stockholm och Örebro, och är i dag 36 anställda. De har en mycket stark position och hög kapacitet inom sitt specialistområde, tack vare deras tydliga fokus på systemintegration och strävan att skapa ett tight partnerskap med deras kunder.\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget har en spännande höst framför sig och vill nu förstärka sitt team med ytterligare en lösningsarkitekt. Vill du vara en del av ett modernt och innovativt It-bolag och arbeta med ett gäng engagerade och kompetenta kollegor som tycker det är viktigt att ha roligt på jobbet?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDu erbjuds\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAtt bli en del av ett kreativt och kundnära företag med högt tempo och härlig stämning. Här jobbar engagerade visionärer och innovatörer!\u003c/li\u003e\n\u003cli\u003eKontinuerlig kompetensutveckling som exempelvis externa konferenser, certifieringar, forum och omvärldsbevakning\u003c/li\u003e\n\u003cli\u003eBra förmåner – Marknadsmässig lön, årlig resultatutdelning, friskvård och resor m.m.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eArbetsuppgifter\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSom lösningsarkitekt kommer du att arbeta i kundspecifika projekt av varierande storlek. Då Integrationsbolaget värderar företagskultur och mentorskap kommer du främst att arbeta inhouse. Du kommer att arbeta med att omsätta verksamhetsarkitektur till tekniska lösningar och vara specialisten inom det arkitekturella området som innefattar infrastruktur, datamodellering och tjänsteorientering. Med en helhetssyn i utvecklingsprocessen kommer du att genomföra lönsamhetsbedömningar för att avgöra hur de tekniska lösningarna ska utformas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVi söker dig som\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHar en högskoleexamen inom system-, datavetenskap, informatik eller liknande.\u003c/li\u003e\n\u003cli\u003eHar erfarenhet av att arbeta som IT-arkitekt\u003c/li\u003e\n\u003cli\u003eHar en god förståelse för arkiterturella mönster: Pace Layered Architecture och API-led Connectivity\u003c/li\u003e\n\u003cli\u003eHar B-körkort\u003c/li\u003e\n\u003cli\u003eHar mycket goda kunskaper i svenska och engelska\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDet är meriterande om du:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHar erfarenhet inom BizTalk Server, API Management och Azure.\u003c/li\u003e\n\u003cli\u003eÄr certifierad IT-arkitekt via Dataföreningen eller motsvarande\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSom person är du:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrategisk\u003c/li\u003e\n\u003cli\u003eAnsvarstagande\u003c/li\u003e\n\u003cli\u003eProblemlösande\u003c/li\u003e\n\u003cli\u003eHar god samarbetsförmåga\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDin personlighet är viktig för oss. Vi värdesätter hög social kompetens och god kommunikativ förmåga då du ska samarbeta internt och externt mot våra kunder och kollegor.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eÖvrig information\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRekryteringsprocessen hanteras av Academic Work och Integrationsbolagets önskemål är att alla frågor rörande tjänsten hanteras av Academic Work.\u003c/p\u003e\n\u003cp\u003eVi går igenom urvalet löpande och annonsen kan stängas ner innan tjänsten är tillsatt om vi gått över till urvals- och intervjufasen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInformation om företaget\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVi är små men stora!\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget är i ständig utveckling som bolag. Vi bearbetar, analyserar och får data att röra på sig – we make systems talk. Den viktigaste faktorn i vår positiva utveckling är medarbetarna. Tillsammans har vi skapat ett klimat med kreativitet, handlingsfrihet och våra kunders behov i fokus.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://jobs.academicwork.se/annons/losningsarkitekt-till-integrationsbolaget/15043119\"\u003ehttps://jobs.academicwork.se/annons/losningsarkitekt-till-integrationsbolaget/15043119\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdktRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--69fee9fee9f3600396b8add00b2d0a9d7f86e9d1/607af0d0-b78c-4ed7-b952-0ca7f3156564.png"},{"id":"a1802589-84c1-425d-a667-9ec8efeaa8e0","type":"Full Time","url":"https://jobs.github.com/positions/a1802589-84c1-425d-a667-9ec8efeaa8e0","created_at":"Mon Nov 23 11:57:21 UTC 2020","company":"Integrationsbolaget","company_url":"https://www.integrationsbolaget.se/","location":"Stockholm","title":"Lösningsarkitekt till Integrationsbolaget","description":"\u003cp\u003e\u003cem\u003e\"Gemenskap och engagemang! Alla som jobbar på Integrationsbolaget är engagerade i sina uppdrag och vill alltid göra sitt yttersta. Vi värdesätter kvalitet och relationen med våra kunder – vilket jag tycker är viktigt. Det finns också en samarbetsvilja och gemenskap mellan oss kollegor, det är aldrig svårt att be om hjälp\". - Sara Larsson, Service Manager\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOm tjänsten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget är ett specialiserat konsultföretag med expertkunskaper inom systemintegration på ledande teknologier i molnet eller on-premises. De grundades 2008 och har idag kontor i Stockholm och Örebro, och är i dag 36 anställda. De har en mycket stark position och hög kapacitet inom sitt specialistområde, tack vare deras tydliga fokus på systemintegration och strävan att skapa ett tight partnerskap med deras kunder.\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget har en spännande höst framför sig och vill nu förstärka sitt team med ytterligare en lösningsarkitekt. Vill du vara en del av ett modernt och innovativt It-bolag och arbeta med ett gäng engagerade och kompetenta kollegor som tycker det är viktigt att ha roligt på jobbet?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDu erbjuds\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAtt bli en del av ett kreativt och kundnära företag med högt tempo och härlig stämning. Här jobbar engagerade visionärer och innovatörer!\u003c/li\u003e\n\u003cli\u003eKontinuerlig kompetensutveckling som exempelvis externa konferenser, certifieringar, forum och omvärldsbevakning\u003c/li\u003e\n\u003cli\u003eBra förmåner – Marknadsmässig lön, årlig resultatutdelning, friskvård och resor m.m.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eArbetsuppgifter\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSom lösningsarkitekt kommer du att arbeta i kundspecifika projekt av varierande storlek. Då Integrationsbolaget värderar företagskultur och mentorskap kommer du främst att arbeta inhouse.\u003c/p\u003e\n\u003cp\u003eDu kommer att arbeta med att omsätta verksamhetsarkitektur till tekniska lösningar och vara specialisten inom det arkitekturella området som innefattar infrastruktur, datamodellering och tjänsteorientering. Med en helhetssyn i utvecklingsprocessen kommer du att genomföra lönsamhetsbedömningar för att avgöra hur de tekniska lösningarna ska utformas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVi söker dig som\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHar en högskoleexamen inom system-, datavetenskap, informatik eller liknande.\u003c/li\u003e\n\u003cli\u003eHar erfarenhet av att arbeta som IT-arkitekt\u003c/li\u003e\n\u003cli\u003eHar en god förståelse för arkiterturella mönster: Pace Layered Architecture och API-led Connectivity\u003c/li\u003e\n\u003cli\u003eHar B-körkort\u003c/li\u003e\n\u003cli\u003eHar mycket goda kunskaper i svenska och engelska\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDet är meriterande om du:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHar erfarenhet inom BizTalk Server, API Management och Azure.\u003c/li\u003e\n\u003cli\u003eÄr certifierad IT-arkitekt via Dataföreningen eller motsvarande\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSom person är du:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrategisk\u003c/li\u003e\n\u003cli\u003eAnsvarstagande\u003c/li\u003e\n\u003cli\u003eProblemlösande\u003c/li\u003e\n\u003cli\u003eHar god samarbetsförmåga\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDin personlighet är viktig för oss. Vi värdesätter hög social kompetens och god kommunikativ förmåga då du ska samarbeta internt och externt mot våra kunder och kollegor.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eÖvrig information\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRekryteringsprocessen hanteras av Academic Work och Integrationsbolagets önskemål är att alla frågor rörande tjänsten hanteras av Academic Work.\u003c/p\u003e\n\u003cp\u003eVi går igenom urvalet löpande och annonsen kan stängas ner innan tjänsten är tillsatt om vi gått över till urvals- och intervjufasen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInformation om företaget\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVi är små men stora!\u003c/p\u003e\n\u003cp\u003eIntegrationsbolaget är i ständig utveckling som bolag. Vi bearbetar, analyserar och får data att röra på sig – we make systems talk. Den viktigaste faktorn i vår positiva utveckling är medarbetarna. Tillsammans har vi skapat ett klimat med kreativitet, handlingsfrihet och våra kunders behov i fokus.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://jobs.academicwork.se/annons/losningsarkitekt-till-integrationsbolaget/15043121\"\u003ehttps://jobs.academicwork.se/annons/losningsarkitekt-till-integrationsbolaget/15043121\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdStRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b38f67310849bb7b4bf6944cd40284bf1ae93fab/607af0d0-b78c-4ed7-b952-0ca7f3156564.png"},{"id":"83cd5517-5c26-4e05-9988-716dd5978712","type":"Full Time","url":"https://jobs.github.com/positions/83cd5517-5c26-4e05-9988-716dd5978712","created_at":"Mon Nov 23 07:59:31 UTC 2020","company":"Delicious Data GmbH","company_url":"https://www.delicious-data.com/","location":"Garching, Munich","title":"Machine Learning Engineer (f/m/d)","description":"\u003cp\u003eAs part of our tech team, you will build software to help our customers combat one of the biggest problems of our society: food waste. With this goal in mind, you will focus on developing and improving our demand forecasting pipeline. We offer you a visionary, innovative environment and give you the support and tools you need to succeed. In our fast growing team there is plenty of room for personal development. Are you ready to build Delicious Data with us and change the world for the better? We are looking forward to getting to know you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs a member of our backend team you will work closely with our Founder, Jakob, responsible for developing and improving our machine learning pipeline\u003c/li\u003e\n\u003cli\u003eYou will have the freedom to implement your own ideas on how to improve and develop our products further\u003c/li\u003e\n\u003cli\u003eYou will make use of our large datasets to create valuable models that save tonnes of food from being wasted every day\u003c/li\u003e\n\u003cli\u003eYou will bring models into production, monitor them and iterate upon your observations to improve their performance\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA degree in Machine Learning, Computer Science, Mathematics, Physics or a related field\u003c/li\u003e\n\u003cli\u003eWhile we value academic experience, we're specifically looking for candidates that have at least 1-3 years professional experience in tackling business challenges using Data Science and Machine Learning\u003c/li\u003e\n\u003cli\u003eYou have experience working on timeseries data and forecasting problems\u003c/li\u003e\n\u003cli\u003eTools like Pandas, scikit-learn, Pytorch are second nature to you\u003c/li\u003e\n\u003cli\u003eYou are passionate about your work and love to collaborate with others\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA lot of room for creative ideas and personal initiative.\u003c/li\u003e\n\u003cli\u003eUse your annual development budget of 1,000 euros, which you can use as you wish to further your professional development.\u003c/li\u003e\n\u003cli\u003e30 days of vacation.\u003c/li\u003e\n\u003cli\u003eWe pay for your public transportation costs.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to getting to know you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://delicious-data.join.com/jobs/1602659-machine-learning-engineer-f-m-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=machine%2Blearning%2Bengineer%2Bf%2Bm%2Bd\"\u003ehttps://delicious-data.join.com/jobs/1602659-machine-learning-engineer-f-m-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=machine%2Blearning%2Bengineer%2Bf%2Bm%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTJRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8de0991e7a1b1884426d34936cd17b9cb2cc4977/delicious-data-gmb-h-logo-l.png"},{"id":"5dd449ae-452f-45d2-8c34-dcf8cca3a118","type":"Full Time","url":"https://jobs.github.com/positions/5dd449ae-452f-45d2-8c34-dcf8cca3a118","created_at":"Sun Nov 22 09:40:47 UTC 2020","company":"Piktochart","company_url":"http:","location":"Remote","title":"Frontend Software Engineer Tech Lead (Europe/Asia)","description":"\u003cp\u003eBesides having technical expertise and knowledge in the Frontend domain, you are someone who is keen in leading and developing a team, as well as ensuring their execution and quality towards achieving the goals collectively.\nYou have the confidence and experience to make key decisions when it comes to technical direction or choices, and not afraid to take calculated risks. Following that, you are then able to plan, communicate, align, lead, and coach the Frontend team towards the direction.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTeam and Culture\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMentor and grow the team members to be both technically strong and culturally aligned\u003c/li\u003e\n\u003cli\u003eRecruit talents who are excited and motivated about our mission and share our HOPEFUL values\u003c/li\u003e\n\u003cli\u003eBi-weekly 1:1s and feedback to ensure mastery, purpose and autonomy as a true human development\u003c/li\u003e\n\u003cli\u003eDriving agile get it done discipline towards planning and shipping increments\u003c/li\u003e\n\u003cli\u003eSet goals and foster continuous development of skills\u003c/li\u003e\n\u003cli\u003eWork with CTO to craft and execute the technical vision to support company goals.\u003c/li\u003e\n\u003cli\u003eHelp the team to understand the business impact and value of their work.\u003c/li\u003e\n\u003cli\u003eHelp the team with estimation, planning and communication with stakeholders.\u003c/li\u003e\n\u003cli\u003eImprove code quality and robustness.\u003c/li\u003e\n\u003cli\u003eInstitute best practices and proper coding standards across the team through processes like code review, pair programming etc.\u003c/li\u003e\n\u003cli\u003eWork with the team to solve technical debt and issues.\u003c/li\u003e\n\u003cli\u003eWork with the team to improve the observability of the system (monitoring, alerting, dashboards).\u003c/li\u003e\n\u003cli\u003eCollaborate with other leads on improving the process and implement best practices (CI/CD, testing, code reviews, retrospectives).\u003c/li\u003e\n\u003cli\u003eEnsure proper documentation of the frontend codebase to ease onboarding and knowledge transfer between developers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou Offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years front end development experience with Javascript/HTML/SCSS.\u003c/li\u003e\n\u003cli\u003eProven history of mentoring and developing others.\u003c/li\u003e\n\u003cli\u003eAble to work in a distributed team environment.\u003c/li\u003e\n\u003cli\u003eYou understand that behind any technical decision there is a business need to be fulfilled.\u003c/li\u003e\n\u003cli\u003eYou think critically about your work and ask questions in order to improve the product, not only in its technical implementation but also in how well it’s serving the needs of our users.\u003c/li\u003e\n\u003cli\u003eYou have built products and UI using modern web technologies and can point to your prior work.\u003c/li\u003e\n\u003cli\u003eYou have the ability to understand the business impact of team’s decision and then rally the team to execute on them.\u003c/li\u003e\n\u003cli\u003eYou have strong communication skills and are able to explain complex technical topics to the entire team in a clear and concise way.\u003c/li\u003e\n\u003cli\u003eYou love front-end technologies but also eager and able to dig into other areas of the product as needed.\u003c/li\u003e\n\u003cli\u003eYou care about your team and their growth. You are focused on developing and growing the people to excel in their role.\u003c/li\u003e\n\u003cli\u003eYou have a strong desire to continuously improve.\u003c/li\u003e\n\u003cli\u003eYou love to be challenged.\u003c/li\u003e\n\u003cli\u003eYou care about the code you leave behind.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eLocation\u003c/strong\u003e\nRemote in Asia / Europe\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://piktochart-jobs.personio.de/job/275795?_pc=262332#apply\"\u003ehttps://piktochart-jobs.personio.de/job/275795?_pc=262332#apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTJPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2915c26f7d47ceb4a236fdce9f491a338b2ead5/vertical-fullcolor.png"},{"id":"9c9bf26c-747c-4a2a-881a-4be19cb8909c","type":"Full Time","url":"https://jobs.github.com/positions/9c9bf26c-747c-4a2a-881a-4be19cb8909c","created_at":"Sat Nov 21 05:16:48 UTC 2020","company":"Avante IO Inc.","company_url":"http://http","location":"remote","title":"Senior Full-Stack Developer","description":"\u003cp\u003eJob Details:\nApplicant Region: Toronto and North America - APPLY ONLY IF YOU RESIDE IN NORTH AMERICA\nPosition Type: Full-time (completely remote)\u003c/p\u003e\n\u003cp\u003eSubmission Requirements: Applicants are asked to include a CV or Resume when reaching out to us for an interview.\u003c/p\u003e\n\u003cp\u003eAvante is looking for an experienced python/full-stack developer who is interested in working in a start-up like environment and helping our team build out cutting-edge underwriting technologies. We are building out exciting technologies (using Agile methodologies) at scale on AWS using some of the following technologies:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePython/Django/DRF\u003c/li\u003e\n\u003cli\u003eReact/Redux/Typescript\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eDocker/ECS/Terraform\u003c/li\u003e\n\u003cli\u003ePusher\u003c/li\u003e\n\u003cli\u003eJIRA/Github/CircleCI\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour responsibilities will include working with underwriters and business associates planning + building new features, fixing existing bugs, and working on performance problems. We are looking for engineers excited about working on hard problems and also feel comfortable with ownership of complicated technical problems.\u003c/p\u003e\n\u003cp\u003eJob Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplementation of software features based on written and visual/design specifications.\u003c/li\u003e\n\u003cli\u003eQuality assurance testing of software contributions. Testing may be performed manually or may take  place in the form of automated unit testing.\u003c/li\u003e\n\u003cli\u003eParticipation and attendance in regularly scheduled SCRUM meetings.\u003c/li\u003e\n\u003cli\u003eDevelopment of software patches or fixes for known bugs or malfunctions i.e. respond to bug reports.\u003c/li\u003e\n\u003cli\u003eUse of organizational and digital communication software to effectively contribute to assigned task works.\u003c/li\u003e\n\u003cli\u003eConformance to standard company operating procedures in all responsibilities.\u003c/li\u003e\n\u003cli\u003eDeveloping front end architecture.\u003c/li\u003e\n\u003cli\u003eDeveloping back end applications with python, Django, PostgreSQL, and Linux.\u003c/li\u003e\n\u003cli\u003eCreating servers and databases for functionality.\u003c/li\u003e\n\u003cli\u003eEnsuring cross-platform optimization for mobile phones.\u003c/li\u003e\n\u003cli\u003eEnsuring responsiveness of applications.\u003c/li\u003e\n\u003cli\u003eWorking alongside graphic designers for web design features.\u003c/li\u003e\n\u003cli\u003eSeeing through a project from conception to finished product.\u003c/li\u003e\n\u003cli\u003eDesigning and developing APIs.\u003c/li\u003e\n\u003cli\u003eMeeting both technical and consumer needs.\u003c/li\u003e\n\u003cli\u003eStaying well-informed of developments in web applications and programming languages.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePython, Typescript, JavaScript, React, Postgres, Docker (LaTeX nice to have)\u003c/li\u003e\n\u003cli\u003eVersion control / Git\u003c/li\u003e\n\u003cli\u003eAlgorithms \u0026amp; Data Structures\u003c/li\u003e\n\u003cli\u003eFundamental principles of software development / software engineering\u003c/li\u003e\n\u003cli\u003eExposure to data types and some knowledge of algorithms\u003c/li\u003e\n\u003cli\u003eExposure to JavaScript (ES6+) (Typescript is nice to have), python, SQL\u003c/li\u003e\n\u003cli\u003eA strong interest or experience in developing software with graphical user interfaces\u003c/li\u003e\n\u003cli\u003eSolid understanding of version control systems e.g. Git or mercurial\u003c/li\u003e\n\u003cli\u003eSome familiarity with Linux/Unix is preferred\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePython: 4 years\u003c/li\u003e\n\u003cli\u003eDjango: 2 years\u003c/li\u003e\n\u003cli\u003eReact.js: 2 years\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApplicants are asked to include a CV or Resume to \u003ca href=\"mailto:johnny@avante.io\"\u003ejohnny@avante.io\u003c/a\u003e when reaching out to us for an interview.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXVPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ffbdd96bec51383561d6aa1608777e306101dee/image.png"},{"id":"a38eb19d-6451-420e-a1f7-f78979701a3a","type":"Full Time","url":"https://jobs.github.com/positions/a38eb19d-6451-420e-a1f7-f78979701a3a","created_at":"Fri Nov 20 16:54:27 UTC 2020","company":"Bright Cellars","company_url":"https://www.brightcellars.com","location":"Remote (USA)","title":"Full Stack Engineer (React, Python)","description":"\u003cp\u003e\u003ca href=\"https://www.brightcellars.com\"\u003eBright Cellars\u003c/a\u003e is the monthly wine subscription startup designed to help new wine drinkers discover and define their taste in wine! We curate wines from around the world with the goal of making wine fun, accessible and educational.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow Bright Cellars works\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur members join Bright Cellars by taking a 7 question-quiz to share their taste preferences. The Bright Points learning algorithm evaluates these preferences to determine the best wine matches for each member’s taste. Each month, members receive four or six unique bottles in the mail, which they are then able to rate and provide personalized feedback on their profile. Similar to Netflix’s collaborative filtering algorithm, Bright Cellars’s algorithm uses this feedback to improve members’ monthly matches going forward.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate is someone who thrives in a highly collaborative culture and adapts in a rapidly changing environment. To succeed in this role, you should be a self-starter who is constantly challenging yourself and your colleagues to grow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll be Working On:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCrafting a frontend dashboard using React, Redux, Highcharts, and any other JS libraries identified along the way that’ll help supercharge the product (e.g. D3.js)\u003c/li\u003e\n\u003cli\u003eDesigning and implementing a backend API using Python’s Flask framework\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKey Technical Skills You’ll Bring:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJS, ReactJS, Redux\u003c/li\u003e\n\u003cli\u003eHTML, CSS, SASS / SCSS, Webpack\u003c/li\u003e\n\u003cli\u003ePython, Flask, unittest, flask_testing, MySQL, PostgreSQL\u003c/li\u003e\n\u003cli\u003eAWS ECS, RDS, Redshift\u003c/li\u003e\n\u003cli\u003eDocker, nginx\u003c/li\u003e\n\u003cli\u003eGit, Github, CircleCI\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eData ETL experience, Apache airflow\u003c/li\u003e\n\u003cli\u003eExperience with advanced data visualization tool  (e.g. D3.js, observable, and vega)\u003c/li\u003e\n\u003cli\u003eExperience with designing and implementing REST APIs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExperience You’ll Bring:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science (or a related field) and 3+ years of relevant experience\u003c/li\u003e\n\u003cli\u003eProficient with HTML, CSS, React (or a similar frontend framework), Python, and MySQL\u003c/li\u003e\n\u003cli\u003eExperience with AWS and CI / CD processes\u003c/li\u003e\n\u003cli\u003eKnowledge of other programming languages a plus\u003c/li\u003e\n\u003cli\u003eWriting testable code\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers site:\n\u003ca href=\"https://jobs.lever.co/brightcellars/d419c64c-6870-44b0-9e59-b2196d61b2cc?lever-source=Github\"\u003ehttps://jobs.lever.co/brightcellars/d419c64c-6870-44b0-9e59-b2196d61b2cc?lever-source=Github\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdW1PIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--77702f2fe294ad121315a511e54096e3e20202f8/bright-cellars-badge-logo.png"},{"id":"380dbebc-31cc-4900-87a8-3625ff6fb22e","type":"Full Time","url":"https://jobs.github.com/positions/380dbebc-31cc-4900-87a8-3625ff6fb22e","created_at":"Fri Nov 20 15:02:35 UTC 2020","company":"Intelligence Group","company_url":null,"location":"Rotterdam (the Netherlands)","title":"Frontend Developer JS","description":"\u003cp\u003e\u003cstrong\u003eFrontend Developer JS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVaste standplaats, klein team, no-nonsense, Rotterdam, 32-40 uur per week \u003c/p\u003e\n\u003cp\u003eMet jouw kennis van JavaScript frameworks, zorg jij ervoor dat de informatie uit onze databases eenvoudig en plezierig beschikbaar is voor onze opdrachtgevers. Wij werken zelf met AngularJS maar ervaring met React.js, Vue.js of vergelijkbaar vinden we zeker zo interessant.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat is er anders dan in jouw huidige baan?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe laten je niet reizen van hot naar haar en van opdrachtgever naar opdrachtgever. Je hebt gewoon een eigen werkplek, tegenover jouw directe collega, ook een Frontend (en een beetje Backend) Developer. Tijdens Corona werken we uiteraard voor een groot deel thuis. Je zult veel samenwerken met onze Data-Analisten, Product Owners en Database-beheerder. Websitebeheer hebben we uitbesteed.\u003c/p\u003e\n\u003cp\u003eIntelligence Group bestaat uit 18 leuke en hulpvaardige collega's. Een relatief klein, enthousiast team vol drive én humor. Voornamelijk twintigers en dertigers, maar ook een aantal 40+'ers. We lunchen samen, borrelen één keer per maand en eten soms een hapje buiten de deur. We weten wat hard werken is, maar ook hoe je samen successen viert. We staan te springen om jouw komst, zodat je ons verder kunt helpen met het op een logische manier toegankelijk maken van onze data. Info die onze klanten helpt hun stuk van de arbeidsmarkt beter te begrijpen. Die ontsluiting van onze data doen we met behulp van producten, applicaties en API's die we zelf bouwen en in eigen beheer hebben.\u003c/p\u003e\n\u003cp\u003eWe combineren de voor ons meest passende elementen van de watervalmethodiek met Agile/Scrum/Sprints. Hoe we dat doen is afhankelijk van de complexiteit van een project en het aantal betrokkenen. Daarnaast zijn we nieuwsgierig naar jouw oplossingen en ideeën en willen met jou samen verder bouwen aan innovatie en kwaliteit.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHerken jij jezelf hierin?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJe bent gek op het kraken van harde noten, het oplossen van schier onmogelijke puzzels en altijd nieuwsgierig naar hoe iets werkt. Vanuit jouw helikopter (nee, je krijgt geen lease-heli) zie en begrijp je hoe onze grote diversiteit aan data is gestructureerd en beweegt. Je bent altijd op zoek naar de meest elegante oplossing. Bovendien neem je mee:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eHbo\u003c/strong\u003e-\u003cstrong\u003ewerk\u003c/strong\u003e- en -\u003cstrong\u003edenkniveau\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eFrontend development is echt jouw ding.\u003c/li\u003e\n\u003cli\u003eJe bent een IT-schoolverlater die heerlijk aan het frontenden is.\u003c/li\u003e\n\u003cli\u003eOf een ervaren \u003cstrong\u003efrontend\u003c/strong\u003e professional.\u003c/li\u003e\n\u003cli\u003eOf een senior die we raken met onze beschrijving van de baan, het werk en de organisatie.\u003c/li\u003e\n\u003cli\u003eJavaScript frameworks (AngularJS, React.js, Vue.js of vergelijkbaar).\u003c/li\u003e\n\u003cli\u003eHTML/CSS.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInteressante extra's vinden we:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLinux/ CentOS/Ubuntu (Bash, SSH, SELinux).\u003c/li\u003e\n\u003cli\u003ePHP7.\u003c/li\u003e\n\u003cli\u003eSQL / Microsoft SQL Server.\u003c/li\u003e\n\u003cli\u003eServices / Daemons kunnen beheren (Apache2, PHP7).\u003c/li\u003e\n\u003cli\u003eAanmaken van Virtual Hosts, .htaccess Files, URL Rewrites.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMocht jouw hart meer liggen bij de backend, ook dan gaan we graag met je in gesprek!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat bieden we jou?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen baan voor 32-40 uur per week.\u003c/li\u003e\n\u003cli\u003eHeel fraai Rotterdams kantoor, tram en bus stoppen voor de deur, de metro om de hoek.\u003c/li\u003e\n\u003cli\u003eEen contract voor onbepaalde tijd.\u003c/li\u003e\n\u003cli\u003eEen marktconform salaris, waarbij we nieuwsgierig zijn naar jouw huidige arbeidsvoorwaarden.\u003c/li\u003e\n\u003cli\u003eEen pensioenregeling.\u003c/li\u003e\n\u003cli\u003eOnkosten- en reiskostenvergoeding, en een laptop.\u003c/li\u003e\n\u003cli\u003eRuimte voor eigen initiatieven en voor inhoudelijke en persoonlijke groei.\u003c/li\u003e\n\u003cli\u003eFlexibele werktijden en de mogelijkheid om regelmatig thuis te werken.\u003c/li\u003e\n\u003cli\u003eInformele, prettige werksfeer, waarin je mag zijn wie je bent.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSolliciteren\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSolliciteren werkt heel eenvoudig! Stuur je cv en een korte toelichting/motivatie \u003cstrong\u003evóór 10 december\u003c/strong\u003e naar Ronald van Driel (samenwerkingspartner van iG!), \u003ca href=\"mailto:ronald@recacc.nl\"\u003e\u003cstrong\u003eronald@recacc.nl\u003c/strong\u003e\u003c/a\u003e. Wij reageren binnen twee werkdagen na ontvangst van jouw sollicitatie.\u003c/p\u003e\n\u003cp\u003eVragen? Mail of bel Ronald (06-5350 2031). Meer informatie over onze organisatie vind je op \u003ca href=\"https://ltpx.nl/Fx3WUpa\"\u003e\u003cstrong\u003ewww.intelligence-group.nl\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/6258baea07957d394395820cf2271ea2f4293bea/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d323036323135\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/TmmEhVZ\"\u003eKlik hier om te solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWFPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--55e643296c086c5940cd44469d81aa53f278354b/logoIG.png"},{"id":"32c6c288-d2d7-44da-bb86-e309091569af","type":"Full Time","url":"https://jobs.github.com/positions/32c6c288-d2d7-44da-bb86-e309091569af","created_at":"Fri Nov 20 14:21:41 UTC 2020","company":"ACTC GmbH tigha","company_url":"http://www.tigha.com","location":"Düsseldorf","title":"WEB DEVELOPER FRONTEND / BACKEND (M/F/X)","description":"\u003cp\u003eBE THE HERO OF YOUR OWN STORY\n\"It all started in 2009 with the search for the perfect leather jacket... The problem was, we couldn't find it – so we decided to create it. Since then, our mission has evolved beyond simply creating leather jackets, and into something much more: to make high-fashion and progressive designs available to a wider audience. Year after year, we continue or re-interpret the classics – jackets, outerwear, shirts, jeans, skirts – by giving them a modern spin. But it's about more than just the clothes themselves. The full collections we now create are expressions of our prevailing value: freedom.\u003c/p\u003e\n\u003cp\u003e// YOUR MISSION\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous further development of the online shop in cooperation with the e-commerce team\nbased on the existing Shopware5 shop system\u003c/li\u003e\n\u003cli\u003eDaily work in the frontend with HTML, Smarty, CSS, and Java Script and / or backend with PHP,\nMySQL and Smarty\u003c/li\u003e\n\u003cli\u003eDevelopment of Shopware plugins and themes\u003c/li\u003e\n\u003cli\u003eTeam-oriented work supported by Git and Jira\u003c/li\u003e\n\u003cli\u003eTechnical support for online marketing campaigns\u003c/li\u003e\n\u003cli\u003eOptimization of loading times as well as the back and front end performance\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e// YOUR PROFIL\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a degree in business or media informatics or computer science or a comparable education\u003c/li\u003e\n\u003cli\u003eYou have professional experience in the field of PHP / web development, ideally in e-commerce\u003c/li\u003e\n\u003cli\u003eExperience with Smarty and Symfony 3\u003c/li\u003e\n\u003cli\u003ePronounced interest in modern web technologies and knowledge of HTML, PHP, MySQL, Java Script\nand CSS\u003c/li\u003e\n\u003cli\u003eSQL or database knowledge\u003c/li\u003e\n\u003cli\u003eBasic experience in working with the shell\u003c/li\u003e\n\u003cli\u003eYou have strong analytical thinking skills combined with a solution-oriented approach\u003c/li\u003e\n\u003cli\u003eInterest in interdisciplinary topics such as CSS\u003c/li\u003e\n\u003cli\u003eYou have a good command of English, both spoken and written\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e// BENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA future-oriented job in an international, expanding company\u003c/li\u003e\n\u003cli\u003eShort decision-making paths and a lot of freedom\u003c/li\u003e\n\u003cli\u003eFree choice of hardware (MAC or PC, you decide)\u003c/li\u003e\n\u003cli\u003eTraining and development opportunities\u003c/li\u003e\n\u003cli\u003eWeekly sports program in the form of yoga\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eupload your application: \u003ca href=\"https://careers.tigha.com/apply?id=ccaf7e\"\u003ehttps://careers.tigha.com/apply?id=ccaf7e\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUNPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--17a2f56ae4680aea5abe9667ec35fc57e2bc123b/LOGO.png"},{"id":"f24dd505-4a18-4e66-8e41-4dd38ac79bc6","type":"Full Time","url":"https://jobs.github.com/positions/f24dd505-4a18-4e66-8e41-4dd38ac79bc6","created_at":"Fri Nov 20 08:22:16 UTC 2020","company":"InnoGames GmbH","company_url":"https://www.innogames.com","location":"Hamburg","title":"Mobile Software Developer (C++) - Video Game: Forge of Empires","description":"\u003cp\u003eOur international, agile, and cross-functional \u003cstrong\u003eForge of Empires\u003c/strong\u003e team is searching for a \u003cstrong\u003eMobile Software Developer\u003c/strong\u003e:\nAs a Mobile Software Developer, you will drive the development of new features as well as maintain and improve the current code of our mobile game Forge of Empires.\u003c/p\u003e\n\u003cp\u003eAre you a talented Mobile Developer and passionate about online games?\nLive your passion for online games/Software Development and collaborate with like-minded people to provide the best user experience for our players!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to the conception and development of the Forge of Empires mobile game\u003c/li\u003e\n\u003cli\u003eContinuously refine and optimize existing features\u003c/li\u003e\n\u003cli\u003eDevelop and optimize our CI/CD pipeline\u003c/li\u003e\n\u003cli\u003eFoster a culture of knowledge sharing, best practices and standards\u003c/li\u003e\n\u003cli\u003eCollaborate closely with Frontend- \u0026amp; Backend Developers, Game Designers, and Artists to increase the user experience for our players\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour skillset:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with C++, Java, Objective-C\u003c/li\u003e\n\u003cli\u003eAt least 2 years of professional experience in native app development (Android, iOS)\u003c/li\u003e\n\u003cli\u003eExcellent understanding of software architecture and design\u003c/li\u003e\n\u003cli\u003eProfound knowledge of continuous integration and tools (e.g. git, Jenkins, Fastlane, Go)\u003c/li\u003e\n\u003cli\u003eGood knowledge of Rendering and Profiling\u003c/li\u003e\n\u003cli\u003eTeam player and a good communicator with fluent English language skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eFavorable\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for online games (strategy/F2P) and knowledge of relevant game mechanics\u003c/li\u003e\n\u003cli\u003eProfessional experience in the gaming industry, ideally working on comparable mobile games\u003c/li\u003e\n\u003cli\u003eTheoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies\u003c/li\u003e\n\u003cli\u003eA proactive and motivated individual with a willingness to learn\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour power-ups:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGet competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more\u003c/li\u003e\n\u003cli\u003eDe-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more\u003c/li\u003e\n\u003cli\u003eParticipate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting\u003c/li\u003e\n\u003cli\u003eMake the most of our excellent training and development opportunities\u003c/li\u003e\n\u003cli\u003eFeel comfortable in an atmosphere to empower creative thinking and strong results\u003c/li\u003e\n\u003cli\u003eWork in an agile multicultural team – enabling you and your team to form and actively optimize work processes\u003c/li\u003e\n\u003cli\u003eOur company language is English, and we support all our employees and their partners with optional German lessons\u003c/li\u003e\n\u003cli\u003eReceive exceptional support with your relocation to Hamburg\u003c/li\u003e\n\u003cli\u003eShape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur story:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInnoGames is Germany's leading developer and publisher of mobile and online games.\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\u003c/p\u003e\n\u003cp\u003eBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExcited to start your journey with InnoGames and join our dynamic team as a Mobile Software Developer?\u003c/strong\u003e\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our \u003ca href=\"https://www.innogames.com/career/detail/job/mobile-software-developer-c-video-game-forge-of-empires/?s=GitHub\"\u003eonline application form\u003c/a\u003e. Maximilian Kaeding would be happy to answer any questions you may have.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eApply and #stayhome!\u003c/strong\u003e\nDue to the \u003cstrong\u003ecoronavirus\u003c/strong\u003e outbreak, we switched our operations company-wide to home office and turned our hiring process into a \u003cstrong\u003efully virtual one\u003c/strong\u003e.\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.innogames.com/career/detail/job/mobile-software-developer-c-video-game-forge-of-empires/?s=GitHub\"\u003ehttps://www.innogames.com/career/detail/job/mobile-software-developer-c-video-game-forge-of-empires/?s=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHlPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df95a50eda44f2249b9d50abaab0388ecc7af33a/logo_innogames_devlop.png"},{"id":"cfd34f2b-d4ff-44f6-abb4-4062c7c8bdeb","type":"Full Time","url":"https://jobs.github.com/positions/cfd34f2b-d4ff-44f6-abb4-4062c7c8bdeb","created_at":"Thu Nov 19 16:16:29 UTC 2020","company":"VendNovation","company_url":"http://vendnovation.com","location":"Redmond, WA","title":"Ember.js - Lead Web Application/UX Developer","description":"\u003cp\u003eVendNovation is seeking a mid-level to senior-level EmberJS software engineer. In this role, you’ll architect and implement the front-end of a new (top secret!) mobile web product launching later this year. You’ll lead the creation of a brand-new mobile web experience, while referencing existing UX designs we’ve already deployed on other platforms. You’ll also be given a CSS stylist, who you can task with ensuring screens look as they should, freeing you to go fast and focus on implementing UX logic. The system will communicate with our back-end business rules through RESTful APIs, which you can have a hand in designing with our back-end engineers.\u003c/p\u003e\n\u003cp\u003eWe’re open to remotely located applicants, assuming you’re in a similar time zone (Pacific) and can travel to our offices periodically for meetings.\u003c/p\u003e\n\u003cp\u003eRequired Qualifications\u003c/p\u003e\n\u003cp\u003e· 5+ years engineering experience\u003c/p\u003e\n\u003cp\u003e· 2+ years EmberJS 3 experience\u003c/p\u003e\n\u003cp\u003e· ES6\u003c/p\u003e\n\u003cp\u003e· Ability to mock APIs in Postman\u003c/p\u003e\n\u003cp\u003e· Familiarity with test-driven development\u003c/p\u003e\n\u003cp\u003e· Familiarity with publishing NPM packages\u003c/p\u003e\n\u003cp\u003e· Git\u003c/p\u003e\n\u003cp\u003e· Experience with REST APIs\u003c/p\u003e\n\u003cp\u003eBonus Experience (not required)\u003c/p\u003e\n\u003cp\u003e· Familiarity with Typescript\u003c/p\u003e\n\u003cp\u003e· Experience working with a UX designer\u003c/p\u003e\n\u003cp\u003e· C#\u003c/p\u003e\n\u003cp\u003e· AWS Lambdas\u003c/p\u003e\n\u003cp\u003e· Dapper\u003c/p\u003e\n\u003cp\u003e· TSQL\u003c/p\u003e\n\u003cp\u003eJob Type: Full-time\u003c/p\u003e\n\u003cp\u003ePay: $75,000.00 - $110,000.00 per year\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:hireme@vendnovation.com\"\u003ehireme@vendnovation.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHFPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98a539b34fd75faede1ffe35572923dcdebcc188/logotype_med.png"},{"id":"6b0acdbd-c94a-42bd-ad64-b2aa59f34407","type":"Full Time","url":"https://jobs.github.com/positions/6b0acdbd-c94a-42bd-ad64-b2aa59f34407","created_at":"Thu Nov 19 14:44:23 UTC 2020","company":"ChannelEngine.com B.V.","company_url":"http://www.channelengine.com","location":"Leiden","title":" DevOps engineer ","description":"\u003cp\u003e\u003cstrong\u003eDevOps engineer\u003c/strong\u003e\n\u003cem\u003eLeiden, 32-40 uur per week\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eVoor ons snelgroeiende Software as a Software (SaaS)-bedrijf ChannelEngine zoeken wij een \u003cstrong\u003eDevOps engineer\u003c/strong\u003e! Word jij gelukkig van \u003cstrong\u003eservers, netwerken en monitoring\u003c/strong\u003e en lijkt het je leuk om onderdeel te zijn van ons innovatieve en professionele team? Dan zijn wij op zoek naar jou!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nOm onze groeiambities waar te kunnen maken, zijn wij op zoek naar een DevOps engineer die ons technische team verder kan versterken met het nog meer schaalbaar maken van ons product, het automatiseren van beheertaken en configureren van servers, netwerken en (monitoring)tools. Je maakt onderdeel uit van ons DevOps team en werkt nauw samen met de ontwikkelteams en bestaande server- en databasebeheerders.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHet automatiseren van bestaande beheertaken.\u003c/li\u003e\n\u003cli\u003eHet configureren en beheren van verschillende interne (monitoring)tools.\u003c/li\u003e\n\u003cli\u003eHet configureren van servers en clouddiensten.\u003c/li\u003e\n\u003cli\u003eHet monitoren van onze systemen en oplossen van waarschuwingen.\u003c/li\u003e\n\u003cli\u003eHet werken aan een schaalbare SaaS-oplossing en met grote datasets.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOnze techstack\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e.NET Framework en Core.\u003c/li\u003e\n\u003cli\u003eMSSQL, Redis, ElasticSearch (ELK), IIS, HaProxy.\u003c/li\u003e\n\u003cli\u003eEen combinatie van Windows en Linux servers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat heeft ChannelEngine jou te bieden?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen afwisselende baan in een gedreven, niet-hiërarchisch scrumteam.\u003c/li\u003e\n\u003cli\u003eBijdragen aan de schaalbaarheid en infrastructuur van een eigen internationaal e-commerce platform.\u003c/li\u003e\n\u003cli\u003eRuimte en verantwoordelijkheid om jouw eigen tijd in te delen.\u003c/li\u003e\n\u003cli\u003eMeegroeien met een snelgroeiend bedrijf met grote internationale plannen en ambities.\u003c/li\u003e\n\u003cli\u003eGezellige collega’s met \u003cstrong\u003egezamenlijke lunch\u003c/strong\u003e en \u003cstrong\u003eflexibele werktijden\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eWerk in een modern kantoorpand naast station Leiden Centraal met eigen \u003cstrong\u003efitnessruimte\u003c/strong\u003e of natuurlijk \u003cstrong\u003evanuit huis\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eErgonomische werkplekken, zit-sta-bureaus en supersnelle PC of laptop met 2 beeldschermen.\u003c/li\u003e\n\u003cli\u003eDarten in je pauzes, \u003cstrong\u003estoelmassages\u003c/strong\u003e, vers fruit en heerlijke koffie van versgemalen bonen.\u003c/li\u003e\n\u003cli\u003eEen pensioenregeling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nOm de vacature voor DevOps engineer op de juiste manier te kunnen invullen, vinden wij het belangrijk dat jij beschikt over de volgende kwaliteiten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe hebt ervaring met \u003cstrong\u003ewebhosting\u003c/strong\u003e, \u003cstrong\u003emonitoring\u003c/strong\u003e en \u003cstrong\u003enetwerkinfrastructuur\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eHet beheren van zowel \u003cstrong\u003ewindows\u003c/strong\u003e als \u003cstrong\u003elinux\u003c/strong\u003eomgevingen is voor jou geen probleem.\u003c/li\u003e\n\u003cli\u003eJe bent bekend met veelgebruikte scriptingtalen zoals \u003cstrong\u003epython\u003c/strong\u003e, \u003cstrong\u003ebash\u003c/strong\u003e of \u003cstrong\u003epowershell\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eJe hebt ervaring met het \u003cstrong\u003eautomatiseren\u003c/strong\u003e van beheertaken.\u003c/li\u003e\n\u003cli\u003eBij voorkeur beschik je over een relevante \u003cstrong\u003ehbo\u003c/strong\u003e-\u003cstrong\u003eopleiding.\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eJe denkt graag mee in een informele en snelgroeiende startup.\u003c/li\u003e\n\u003cli\u003eErvaring met \u003cstrong\u003eDocker\u003c/strong\u003e en \u003cstrong\u003eclouddiensten\u003c/strong\u003e is een pluspunt.\u003c/li\u003e\n\u003cli\u003eJe beschikt over goede communicatieve vaardigheden en spreekt uitstekend \u003cstrong\u003eEngels\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eJe houdt jezelf graag op de hoogte met de laatste ontwikkelingen in je vakgebied.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat is ChannelEngine?\u003c/strong\u003e\nChannelEngine is een \u003cstrong\u003esnelgroeiend SaaS-platform\u003c/strong\u003e dat webshops, ERP’s en elk ander pakket aan Europese online marketplaces koppelt. Grote partijen zoals Amazon, Bol.com, eBay, Cdiscount, Carrefour, Otto en vele anderen zijn partner van ons. Daarnaast werken wij voor mooie klanten zoals Gall \u0026amp; Gall, Travelbags, Omoda en Body \u0026amp; Fit.\u003c/p\u003e\n\u003cp\u003eVia ChannelEngine kan een bedrijf haar producten direct online aanbieden op \u003cstrong\u003emeerdere\u003c/strong\u003e \u003cstrong\u003emarketplaces\u003c/strong\u003e tegelijk. De bestellingen worden vanaf de kanalen opgehaald en in de omgeving van de klant verwerkt voor verdere afhandeling. De terugkoppeling van zendingen gebeurt vervolgens ook via ChannelEngine, waardoor het hele traject op effectieve wijze geautomatiseerd kan worden. Door deze volledig automatische afhandeling kunnen onze klanten vanuit hun eigen systeem veel \u003cstrong\u003eextra verkoopkanalen\u003c/strong\u003e bedienen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReady to go?\u003c/strong\u003e\nDit is het moment om in te stappen. Stuur ons je cv en een motivatiebrief naar \u003ca href=\"mailto:jobs@channelengine.com\"\u003e\u003cstrong\u003ejobs@channelengine.com\u003c/strong\u003e\u003c/a\u003e. Kijk voor meer informatie over de organisatie op \u003ca href=\"https://ltpx.nl/kiiJ0RZ\"\u003e\u003cstrong\u003ewww.channelengine.com\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/35a52ef20489335440555bcd0a7b5bd7df9e1ad9/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d323034383935\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/FSXatBx\"\u003eKlik hier om te solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGlPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--146fbe17c4e5c6380d139692bb2d200b73c28a23/1536928075Channel-Engine-avatar1.jpg"},{"id":"68633180-4186-42f7-ab28-2b762a3bf794","type":"Full Time","url":"https://jobs.github.com/positions/68633180-4186-42f7-ab28-2b762a3bf794","created_at":"Thu Nov 19 09:57:50 UTC 2020","company":"Wonder","company_url":"https://www.wonder.me/","location":"Berlin, BE, DE","title":"Engineering Manager (f/m/d)","description":"\u003cp\u003eEngineering Manager (f/m/d)\u003c/p\u003e\n\u003cp\u003eOur mission is to give the world a space where groups can meet and talk**\nOnline meetings are transactional. This means that the human side of getting together gets lost, the side that lives off spontaneous chats, random encounters or unexpected conversations. We believe that's at the core of 'Zoom fatigue' - not poor video connection or audio issues.\u003c/p\u003e\n\u003cp\u003eWonder is a virtual space where you can connect to others in a more spontaneous and fluid way. You walk around freely and choose what groups you want to join. It's fun, creative, energizing and we believe it's the future of how people will get together online. You can check it out \u003ca href=\"https://www.wonder.me/r?id=wonder-team-office\"\u003e\u003cstrong\u003ehere\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe're a VC-backed team based in Kreuzberg, Berlin. If you want to learn more about us and what it's like to work at Wonder, have a look at this \u003ca href=\"https://app.pitch.com/app/public/presentation/79be9368-d12b-41a1-b2a3-fb3e9f50c420\"\u003e\u003cstrong\u003epresentation\u003c/strong\u003e\u003c/a\u003e we created for you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou will be part of our world-class product team\u003c/strong\u003e\nThe mission of our product team is to define and execute the product vision. We ship major new features bi-weekly while making sure the product runs smoothly and without bugs. We're fast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs part of that team, you will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead the technical development of the product.\u003c/li\u003e\n\u003cli\u003eOwn the ongoing refactoring process.\u003c/li\u003e\n\u003cli\u003eHelp developers grow and learn along technical and non-technical dimensions.\u003c/li\u003e\n\u003cli\u003eContribute your best knowledge and experience about technology, products, and processes.\u003c/li\u003e\n\u003cli\u003eShape the product roadmap with us.\u003c/li\u003e\n\u003cli\u003eWrite code (duh).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho we look for\u003c/strong\u003e\nBroadly speaking, we look for product people. Concretely, this means you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave experience in building an engaged and high-performance team.\u003c/li\u003e\n\u003cli\u003eYou are a strong communicator around hard concepts and have a pragmatic approach.\u003c/li\u003e\n\u003cli\u003eKnow the latest state of technology and what we can do with it.\u003c/li\u003e\n\u003cli\u003eHave a strong instinct for great products and what makes them great.\u003c/li\u003e\n\u003cli\u003eLove Wonder as much as we do.\u003c/li\u003e\n\u003cli\u003eExperience in JavaScript and one or more programming languages (e.g. C/C++, Python, Go, Java).\u003c/li\u003e\n\u003cli\u003eExperience across the full JS-based stack (both Node.JS and ReactJS).\u003c/li\u003e\n\u003cli\u003eIdeally, you have experience with PostgreSQL, Kubernetes, WebRTC, Redis, CI/CD.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe strongly encourage female and diverse candidates to apply. The role is based in Berlin, with flexible working arrangements, a generous equity package, and competitive pay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy you should join us\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOur work is technically challenging: we're using WebGL for rendering 3-dimensional rooms that expand when more users join. Now, we are starting to build our own WebRTC backend. It's incredibly challenging to enable real-time communication and data-flow between thousands of user.\u003c/li\u003e\n\u003cli\u003eThe future of work is a hot topic: remote communication will transform the way humans live and work. We want to become a core pillar of the online working stack. You'll tell your grandchildren that you were part of it.\u003c/li\u003e\n\u003cli\u003eWe have a world-class engineering team: we're a product-focused company and are assembling some of the smartest and most talented developers and designers to build Wonder.\u003c/li\u003e\n\u003cli\u003eIt's an exciting stage: You will shape a product from the very beginning and see its fastest growth. If you want to build something, this is just the right time.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\nApply via the online \u003ca href=\"https://ltpx.nl/jLQj7wM\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/043b19c9a2a9e79b91089ecb661e02dc67dbeeaa/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d323034333334\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/8k8r075\"\u003eClick here to apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGFPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dcf8ec40e54f148e3cc0c98858553486f016ec36/wonder.jpg"},{"id":"7b329931-be72-463e-ae62-3cd4c2323b64","type":"Full Time","url":"https://jobs.github.com/positions/7b329931-be72-463e-ae62-3cd4c2323b64","created_at":"Thu Nov 19 09:09:39 UTC 2020","company":"api.video","company_url":"https://api.video/","location":"Bordeaux, NAQ, FR","title":"Developer Advocate","description":"\u003cp\u003e\u003cstrong\u003eDeveloper Advocate\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eapi.video connects people through their cameras. Join us to build the first worldwide video backbone!\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe are an \u003cstrong\u003eAPI-first platform to manage online video\u003c/strong\u003e and our goal is to become a new standard, such as Stripe for the payments, Twilio for text and VOIP or Sendgrid for email.\u003c/li\u003e\n\u003cli\u003eWe are building our own **EDGE infrastructure **to provide unprecedented performances on the market\u003c/li\u003e\n\u003cli\u003eWe have raised a $5.5M Seed Round in June 2020 from Blossom Capital, Kima Ventures and some incredible Angels.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe are growing our remote-first developer relations team. We are open to all locations, but have a preference for North America at this time.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeveloper Relations:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re an API first, developer centered business. Our customers ARE developers, and they expect our documentation, examples and demos to work right the first time.\u003c/li\u003e\n\u003cli\u003eOur team plays a critical role in creating developer centered content, help our customers to tackle the API, guide them to achieve their video project, and taking feedback back to the team for improvements.\u003c/li\u003e\n\u003cli\u003eWe handle all the documentation, coordinate and write blogs, tutorials, and technical questions. We create videos, presentations, everything that is technical consumed externally comes through the team.\u003c/li\u003e\n\u003cli\u003eWe design and build sample apps, support the SDKs and open source tooling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJob requirements\nYou are a:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e**Technical communicator **- You love writing. Bonus if you’ve written blog posts, documentation or other technical documents. Bonus Bonus if you’ve spoken at meetups or conferences.\u003c/li\u003e\n\u003cli\u003e**Creative problem solver **- When posed with a question, you can come up with a solution that meets the customer’s requirements. You can brainstorm ideas for projects that will interest the community.\u003c/li\u003e\n\u003cli\u003e**Coding **- Some experience here is great. We’re not going to specify x years of experience, or list the top 8 languages our customers use. We want a penchant to learn new things and a willingness to dive in and figure out the issues.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eHumble\u003c/strong\u003e - We get questions from all levels of developers, with lots of different experiences. Being able to meet each developer to provide support. We are here to gain the trust of our customers.\u003c/li\u003e\n\u003cli\u003e**Initiative **- Is there a problem? Something missing that needs to be done? Go for it!\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eMotivated and a self started\u003c/strong\u003e - Our North America team is just starting, so you’ll be working on your own for parts of the day.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePackage\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive pay and equity.\u003c/li\u003e\n\u003cli\u003eAnnual Bonus.\u003c/li\u003e\n\u003cli\u003eCovered medical, dental, and vision benefits for you and your family.\u003c/li\u003e\n\u003cli\u003eCompany Provided Equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eapi.video is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\nApply via the \u003ca href=\"https://ltpx.nl/lyrQnNd\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/5849cf09861d5becb42590b2749191b51c185b79/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d323036323837\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/lyrQnNd\"\u003eClick here to apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdE9PIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3927b1fae364b50723ed991c3f0a7f6bfcbcb5d7/api.video%20logo.png"},{"id":"a3fb4556-a1be-48dc-b4da-e3f439560ab5","type":"Full Time","url":"https://jobs.github.com/positions/a3fb4556-a1be-48dc-b4da-e3f439560ab5","created_at":"Mon Oct 19 18:43:11 UTC 2020","company":"AXIOS","company_url":"http://axios.com","location":"Remote (USA)","title":"Director of Engineering","description":"\u003cp\u003eQuick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We're hiring a Director of Engineering!\u003c/p\u003e\n\u003cp\u003eWhy it Matters: Delivering great products means great passionate and talented technologists. The Director of Engineering will set standards for Axios while growing, coaching, and holding accountable the staff that delivers our compelling products.\u003c/p\u003e\n\u003cp\u003eThe Details: Ideal candidates will embody an entrepreneurial spirit, a passion for Axios’ mission and will be responsible for the following:\u003c/p\u003e\n\u003cp\u003eWork closely with Product, Design, and Engineering leadership to build a vision for technology at Axios\nPartner with Engineering Managers to set standards and define best practices\nHire, retain, support, and grow the engineering talent Axios needs to succeed\nCoach and mentor staff to help them grow in their abilities as they work with cross-functional product-oriented team members\nEnsure all engineers in your domain are delivering high-quality technical output\nOversee architectural process and help grow architectural skills across engineering\nPartner with engineers to plan, problem solve, and optimize for the best technical solutions\nDemonstrate excellent judgment in professional and technical decision making\nWeigh risk, maintainability, cost-impact, dev-impact, and business impact, to result in proposing the best possible solution\nPromote test-driven-development and prioritize strategies to reduce risk \nBe an authority on end-to-end systems architecture and modern pipeline design\nHold yourself and your team accountable to delivering high-quality, pragmatic results that meet the needs of the business in the timelines provided\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eProven track record with extensive experience as a software engineer, architect, and manager with deep, current technical experience \nExperience leading and managing multiple teams of developers in a fast-growth environment\nDeep, current technical capacity with software development, front-end architecture, data design and implementation, and enterprise-grade software delivery\nProven track record of creating pragmatic, maintainable systems, using industry-recognized best practices\nExperience shipping, maintaining, scaling, and evolving highly-utilized production products \nDeep experience applying agile practices to streamline team delivery and output\nSignificant, current knowledge of Python, Node related frameworks, and technologies\nExpertise in frontend technologies, specifically React and React Native\nExperience with Go or Native Mobile development, is a plus\nExtensive experience evaluating, implementing, and supporting third-party solutions for ad-tech, BI tooling, and general analytics a huge plus\nA passion for the Axios mission and media \u003c/p\u003e\n\u003cp\u003eDon’t forget:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\nAnnual learning and development stipend\u003c/p\u003e\n\u003cp\u003eAdditional pandemic-related benefits:\u003c/p\u003e\n\u003cp\u003eOne mental health day per month\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/029a4eb71us\"\u003ehttps://grnh.se/029a4eb71us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaitNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6cc0e96250117c5a25779da18ad1a2c5a2d98338/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"},{"id":"8a2e3d35-65ba-411d-9952-2e1940b73a4a","type":"Full Time","url":"https://jobs.github.com/positions/8a2e3d35-65ba-411d-9952-2e1940b73a4a","created_at":"Mon Oct 19 19:43:52 UTC 2020","company":"QSC, LLC","company_url":"http://www.qsc.com","location":"Boulder, CO","title":"Senior Software Engineer","description":"\u003cp\u003eQSC is a world leader in the design and manufacture of innovative audio, video, and control products for multiple markets including Installed Systems, Cinema, and Live Sound.  We are seeking a talented and motivated Software Engineer to work with our growing engineering team on our state of the art Q-SYS platform.\u003c/p\u003e\n\u003cp\u003eThe Senior Software Engineer will be responsible for design and implementation of application software in Linux OS for a wide variety of projects for Q-SYS. You will have the ability to bring creative solutions to our customers and the audio, visual, and control product space, while working in a dynamic and collaborative agile scrum environment.\u003c/p\u003e\n\u003cp\u003eThis position is based in Boulder, Colorado.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e•Design and develop world-class software on our industry-leading Q-SYS platform\n•Work with Software Quality Assurance to develop appropriate test strategies\n•Perform other duties as assigned\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003e•B.S. in Computer Science, Computer Engineering, or a related field\n•Minimum 5 - 7 plus years’ hands-on experience developing C++ application software in Linux OS\n•Experience with the features of modern C++ and its effective use in solving real-world problems\n•Experience with the best principles, practices, and patterns of software architecture and design\n•Proficiency in several of the following areas:◦Communications protocols\n◦Web technologies\n◦Computer security and data privacy\n◦Streaming media protocols\n◦Real-time embedded systems\n◦High performance, distributed, or high availability systems\n◦Unit testing\n•Experience working with large scale C++ codebases\n•Experience working on software programs developed collaboratively by international teams\n•Ability to perform a software lead role on projects\n•Passionate, persistent, creative - you find solutions to difficult problems and clever ways to work around them when necessary\n•Ability to work collaboratively in an agile scrum environment\n•Superb communication skills in English, both written and verbal\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers site: \u003ca href=\"https://qsccareers-qsc.icims.com/jobs/2655/senior-software-engineer/job\"\u003ehttps://qsccareers-qsc.icims.com/jobs/2655/senior-software-engineer/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1dNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7c5090b2cc1d8ac27b85146b3ba7def6abf0bc9e/QSC_LOGO_BLUE.jpg"},{"id":"26507d9e-8c9f-48ec-ba24-bee590c1b49a","type":"Full Time","url":"https://jobs.github.com/positions/26507d9e-8c9f-48ec-ba24-bee590c1b49a","created_at":"Mon Oct 19 19:37:31 UTC 2020","company":"QSC, LLC","company_url":"http://www.qsc.com","location":"Costa Mesa, CA","title":"Quality Engineer","description":"\u003cp\u003eQSC thrives where innovative technology and compelling audio-visual experiences intersect. For over 50 years, QSC has pioneered the technology and solutions that enable immersive cinema, live performance audio, themed entertainment, digital collaboration and meeting experiences for our customers and partners around the world. A globally recognized innovator in the design, engineering, and manufacture of category leading high-performance loudspeakers, digital mixers, power amplifiers, audio processors, digital cinema solutions, and the Q-SYS™ software-based audio, video and control Ecosystem.\u003c/p\u003e\n\u003cp\u003eBy joining the QSC team, you will be in a challenging, collaborative, fun, and innovative environment. We encourage employees to take ownership, to color outside the lines, and to imagine possibilities. Our culture is casual but dynamic, with cross-functional teams collaborating on creating memorable audio-visual experiences that deliver joy to people, wherever they are. At QSC, fun and hard work go hand in hand. Join us and make a difference in the way people experience movies, meetings, presentations, live performances, and much more.\u003c/p\u003e\n\u003cp\u003eThe Quality Engineer is a technical engineering position focused on the successful implementation of projects and process management of activities to define, design, develop and deliver new processes, quality improvements, and change initiatives.  The Quality Engineer works on a wide range of supplier quality issues during development projects and monitors and addresses supplier quality issues after the products are in volume production. The Quality Engineer has extensive practical application experience in quality systems, product quality, and supplier quality management that will result on high quality products and great customer satisfaction.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e•Execute tasks associated with assuring process readiness, process capability, and process effectiveness at domestic and offshore suppliers.\n◦Typical tasks might include:\n•Generate and execute Quality Plans to assure that product and process requirements are met\nat each product lifecycle phase.\n•Create and execute Part Qualification plans for new parts, new tooling or new suppliers.\n•Support the maintenance of quality system requirements, including internal and supplier\nauditing, Corrective and Preventive Action (CAPA), risk management, product and process\nissues.\n•Participate in design reviews and recommend improvements.\n•Identify technical risks and challenges and recommend corrective/improvement actions.\n•Determine process readiness, measure and improve process capability; and measure and improve process effectiveness.\n•Develop and implement process performance criteria to evaluate the readiness of new products to move from New Product Introduction lifecycles to volume production.\n•Analyze process performance indicators, such as critical-to-quality variables, yield data, out-of-box audit data, process capability reports, and defect trends, against predefined targets and initiate remedial actions where necessary.\n•Able to apply statistical techniques and other standard quality problem solving tools where appropriate.\n•Lead in-process and product audits.\n•Resolve supplier issues; generate CARs, NCMRs, Stop Orders, Rework Instructions, etc.\n•Evaluate Supplier Performance via Quality Business Review (QBR)\n•Evaluate the efficiency of existing QA processes and recommend improvements.\n•Perform other duties as assigned.\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003e•B.S. degree in a technical discipline (ME, EE, or Industrial Engineering with a specialty in Quality, preferred)\n•Subject matter expertise in the Body of Knowledge for ASQ CQE (Certified Quality Engineer) is preferred. Certification as a CQE is desired. See ASQ.com.\n•Experience supporting an ISO9000-2015 Quality System highly desired.\n•Minimum 10-years’ experience as a Quality Engineer in a medium volume, a high-mix manufacturer of electronic or electromechanical products is required.\n•Minimum 5-years’ experience managing supplier quality performance at offshore contract manufacturers is desired. (Contract manufacturers could include system assembly manufacturers and/or design and build manufacturers.)\n•Experience with process control practices in the following types of operations is desired: PCBA assembly, plastic injection molding, sheet metal fabrication, wood cabinet fabrication, system assembly, and test.\n•Professional audio industry experience is a plus.\n•Perform tasks as assigned with minimum direction and oversight from the Quality leadership team\n•Previous experience in speaker, electronic or electromechanical assembly experience is desirable.\n•Proficiency in Office software for data collection, analysis, and reporting is required\n•Previous experience with enterprise management software tools such as Oracle and PLM Agile is desirable\n•Excellent verbal and written communication skills\n•Bilingual (English/Spanish or English/Chinese) is desirable\u003c/p\u003e\n\u003cp\u003eQSC is not accepting vendor solicitation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers site: \u003ca href=\"https://qsccareers-qsc.icims.com/jobs/2607/quality-engineer/job\"\u003ehttps://qsccareers-qsc.icims.com/jobs/2607/quality-engineer/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa09NIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1a1ad67d0fc5f3f70c68e958ba34944b25490842/QSC_LOGO_BLUE.jpg"},{"id":"492cb2e4-087c-469e-906b-f8ae01a819f0","type":"Full Time","url":"https://jobs.github.com/positions/492cb2e4-087c-469e-906b-f8ae01a819f0","created_at":"Wed Nov 18 20:28:43 UTC 2020","company":"Interaction Design Foundation","company_url":"http:","location":"Remote","title":"Senior PHP Developer (Laravel)","description":"\u003cp\u003eDo you want to use your coding skills to improve the lives of millions of people? Are you brave enough to \u003cstrong\u003elet millions of UX designers use your code\u003c/strong\u003e? Are you obsessive about your own \u003cstrong\u003eprofessional development\u003c/strong\u003e and \u003cstrong\u003econtinuous learning-through-doing\u003c/strong\u003e? Then read on!\u003c/p\u003e\n\u003cp\u003eThe Interaction Design Foundation is the biggest online design school globally. Founded in 2002, we have over 90,000 graduates and counting. We're \u003cstrong\u003emarket leaders\u003c/strong\u003e in online design education because the \u003cstrong\u003eworld's leading experts\u003c/strong\u003e create our content and because we're specialized in design. What’s more, with over 1.5 million monthly visitors, we’re at the forefront of providing premier design education to such organizations as IBM and SAP, as well as thousands of other companies. Our ever-growing community now needs a first-class back-end developer to \u003cstrong\u003ehelp craft the ultimate user experience\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eThis is where your \u003cstrong\u003elonging for meaningfulness in your work and your hard-science coding skills merge\u003c/strong\u003e: Every time your code is executed, \u003cstrong\u003eyou help improve the life of a human being\u003c/strong\u003e. And not only that, those members will likely go on to design better products and services to the benefit of all humankind.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur codebase is our baby\u003c/strong\u003e and it can never become too perfect. It is a \u003cstrong\u003evital part of our winning formula\u003c/strong\u003e. You will, therefore, become \u003cstrong\u003ean essential part of our long-term success\u003c/strong\u003e, someone who is making a \u003cstrong\u003edirect impact\u003c/strong\u003e on not only the growth and reputation of our foundation but also the whole world of design education and beyond!\u003c/p\u003e\n\u003cp\u003eThis is a paid \u003cstrong\u003efull-time\u003c/strong\u003e position which is \u003cstrong\u003elocation independent\u003c/strong\u003e. You will have regular video-based contact with your colleagues and get to meet them physically on team trips.\u003c/p\u003e\n\u003ch2\u003eWhat you will be doing\u003c/h2\u003e\n\u003cp\u003eYou will join our team as our Senior PHP Developer (Laravel) and your main responsibilities will be to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite clean and maintainable code with good test coverage.\u003c/li\u003e\n\u003cli\u003eImplement new features in collaboration with our design team.\u003c/li\u003e\n\u003cli\u003eOptimize existing code to perfection with special attention to performance and maintainability.\u003c/li\u003e\n\u003cli\u003eDo code review of your colleagues’ work.\u003c/li\u003e\n\u003cli\u003eHelp improve our Design System at \u003ca href=\"https://design-system.interaction-design.org\"\u003ehttps://design-system.interaction-design.org\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eHelp yourself, and the whole team, get better and better. For example, by improving our handbook at \u003ca href=\"https://handbook.interaction-design.org\"\u003ehttps://handbook.interaction-design.org\u003c/a\u003e. Or use our library of evergreen literature on back-end and front-end subjects to broaden your horizon.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYou and our future-proof stack\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWe seek a balance between sticking with what works and fearlessly exploring the new.\u003c/li\u003e\n\u003cli\u003eWe use the latest stable version of PHP 7 because it allows us to write better code using features like strict type declarations, typed class properties and arrow functions.\u003c/li\u003e\n\u003cli\u003eWe leverage the elegance, simplicity and readability of the latest Laravel version.\u003c/li\u003e\n\u003cli\u003eWe want to spend our precious time on things that matter the most; that's why we perfect our easy to run development environment with Homestead and custom scripts.\u003c/li\u003e\n\u003cli\u003eWe write and run tests with PHPUnit and cypress.io.\u003c/li\u003e\n\u003cli\u003eWe have a great set of tools to maintain the code quality and run on CI/CD (psalm (error level 4), rector, phpcs, php-cs-fixer, phpcpd etc.)\u003c/li\u003e\n\u003cli\u003eWe use Rector to maintain our code quality.\u003c/li\u003e\n\u003cli\u003eWe’re constantly refactoring our front-end code with the goal of reaching front-end heaven:\n\u003cul\u003e\n\u003cli\u003eLaravel Blade template engine.\u003c/li\u003e\n\u003cli\u003ePostCSS to maximize the power of modern CSS.\u003c/li\u003e\n\u003cli\u003eWebpack for perfect control over front-end assets.\u003c/li\u003e\n\u003cli\u003eLatest JS with support for ES2020 features. To accomplish this we use the latest Babel releases.\u003c/li\u003e\n\u003cli\u003eBEM/ITCSS in combination with Tailwind CSS based utility classes.\u003c/li\u003e\n\u003cli\u003eA custom-made design system (\u003ca href=\"https://design-system.interaction-design.org\"\u003ehttps://design-system.interaction-design.org\u003c/a\u003e) to achieve consistency and ease of use.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eForget IE and clunky workarounds for compatibility with other dinosaur browsers: We spend our time only on modern Web APIs since we only support evergreen browsers.\u003c/p\u003e\n\u003cp\u003eWe ❤ CI (Continuous Integration) and CD (Continuous Delivery) so we usually deploy a few releases per day: Zero downtime. Just a few buttons to push. No sweaty palms.\u003c/p\u003e\n\u003cp\u003eWe care deeply about Developer Experience (DX) of our codebase and tools. DX and DevOps is our middle name: Git, GitHub, HTTP/2, Assets CDN, AWS, Enterprise SSDs on our high-spec servers, and much more.\u003c/p\u003e\n\u003ch2\u003eAbout you\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou have expert knowledge of PHP.\u003c/li\u003e\n\u003cli\u003eYou have expert knowledge of Laravel or Symfony.\u003c/li\u003e\n\u003cli\u003eYou have experience with test-driven development (TDD).\u003c/li\u003e\n\u003cli\u003eYou have 6+ years of experience working professionally with OOP.\u003c/li\u003e\n\u003cli\u003eYour work is based on a solid foundation in computer science fundamentals from data structures and algorithms to design patterns.\u003c/li\u003e\n\u003cli\u003eYou are an engineer by mindset and always try to understand how things work under the hood.\u003c/li\u003e\n\u003cli\u003eYou have substantial experience working with RESTful web services and ORM concepts.\u003c/li\u003e\n\u003cli\u003eYou love to learn through doing. You’re ready to put in some hard work to expand your skills.\u003c/li\u003e\n\u003cli\u003eYou speak and write acceptable English – not perfect English, just acceptable – since you will be working with people from the US, England, Canada, Denmark, Belarus and Brazil among others.\u003c/li\u003e\n\u003cli\u003eYou are a team player and you don't bring your ego to work.\u003c/li\u003e\n\u003cli\u003eYou are self-motivated and self-disciplined and thus work well in a flat hierarchy with lots of freedom.\u003c/li\u003e\n\u003cli\u003eYou love to have creative freedom, make independent judgments and live up to the responsibility that comes with that freedom.\u003c/li\u003e\n\u003cli\u003eYou love to create tangible results—every hour and every day.\u003c/li\u003e\n\u003cli\u003eYou love to make a positive impact on the world and the lives of others.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBonus points\u003c/h2\u003e\n\u003cp\u003eYou get bonus points…\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e…if you have contributed to open source\u003c/li\u003e\n\u003cli\u003e…if you have worked professionally with at least one statically typed programming language like C, C++, Java, Kotlin, Rust, Scala, TypeScript, etc.\u003c/li\u003e\n\u003cli\u003e…if you have a Master’s Degree in Computer Science\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eHow to Learn More and Apply\u003c/h2\u003e\n\u003cp\u003eYou can learn more about our Work Culture and Values here: \u003ca href=\"https://www.interaction-design.org/careers\"\u003ehttps://www.interaction-design.org/careers\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePlease apply as soon as you can—we’re firm believers in the adage “the sooner, the better”, and we look forward to working with you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease go to \u003ca href=\"https://www.interaction-design.org/careers\"\u003ehttps://www.interaction-design.org/careers\u003c/a\u003e and make sure to watch the whole video to learn more about our Work Culture and Values.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--885d4c1d8d3ba70aecb97cf4e7f5882c0d88e5b1/LOGO%20IDF.jpg"},{"id":"3c76cd64-2149-4f3f-8fbd-b3e547ea2b52","type":"Full Time","url":"https://jobs.github.com/positions/3c76cd64-2149-4f3f-8fbd-b3e547ea2b52","created_at":"Tue Nov 17 22:35:50 UTC 2020","company":"Nisum","company_url":"https://www.nisum.com/","location":"San Francisco","title":"UI Technical Lead","description":"\u003cp\u003eNisum is a leading global digital commerce firm headquartered in California, with services spanning digital strategy and transformation, insights and analytics, blockchain, business agility, and custom software development. Founded in 2000 with the customer-centric motto “Building Success Together®,” Nisum has grown to over 1,400 professionals across the United States, Chile, India, and Pakistan. A preferred advisor to leading Fortune 500 brands, Nisum enables clients to achieve direct business growth by building the advanced technology they need to reach end customers in today’s world, with immersive and seamless experiences across digital and physical channels.\u003c/p\u003e\n\u003cp\u003eWe are currently looking for UI Technical Lead profiles with a strong technical and handson experience  in React / Node JS with ability to lead and work with a team of developers.\u003c/p\u003e\n\u003cp\u003eWhat You will Do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetent in programming and debugging across multiple modules and dealing with related external dependencies\u003c/li\u003e\n\u003cli\u003eProvides story or business requirements breakdown planning and estimation, reviews, and evaluates the team's estimates\u003c/li\u003e\n\u003cli\u003eAccountable for complex stories or business requirements\u003c/li\u003e\n\u003cli\u003eIdentifies feature and module dependencies\u003c/li\u003e\n\u003cli\u003eProposes mitigation plans for identified risks and problems\u003c/li\u003e\n\u003cli\u003eSuggests process improvements and best practices\u003c/li\u003e\n\u003cli\u003eAble to identify, evaluate and discuss alternative technologies and techniques\u003c/li\u003e\n\u003cli\u003eInteracts with team members, other IT teams, business users, individual contributors, managers\u003c/li\u003e\n\u003cli\u003eActively shares knowledge within domain and outside domain as well\u003c/li\u003e\n\u003cli\u003eMentors co-workers within area of expertise, improves other's productivity\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat You Know:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e10 years and above overall years of experience\u003c/li\u003e\n\u003cli\u003eExpertise in React / NodeJS\u003c/li\u003e\n\u003cli\u003eExperience in managing a team\u003c/li\u003e\n\u003cli\u003eAble to understand the requirements from the business stakeholders and work with remote location teams.\u003c/li\u003e\n\u003cli\u003eExperience in Devops is a nice to have skill\u003c/li\u003e\n\u003cli\u003eShould have experience with New Relic\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation:\nBachelor’s degree in Computer Science, Information Systems, Engineering, Computer Applications, or related field\u003c/p\u003e\n\u003cp\u003eNisum is an Equal Opportunity Employer and we are proud of our ongoing efforts to foster diversity and inclusion in the workplace.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your responses to \u003ca href=\"mailto:aykumar@nisum.com\"\u003eaykumar@nisum.com\u003c/a\u003e. We look forward to connecting with you soon and taking this forward.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3VPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--44b204280f6a3d7d2e85aaae6235b2683bb79bde/Nisum%20logo.png"},{"id":"50846e5f-fc5d-465d-9796-e15d7e3cb917","type":"Full Time","url":"https://jobs.github.com/positions/50846e5f-fc5d-465d-9796-e15d7e3cb917","created_at":"Tue Nov 17 21:42:16 UTC 2020","company":"Nebo Agency","company_url":"https://www.neboagency.com/","location":"Atlanta, GA","title":"Front-End Engineer","description":"\u003cp\u003eSimply put: Nebo’s engineering team gets things done. That usually looks like using the art of code to solve problems and build solutions for clients and coworkers alike. We don’t get hung up on what hasn’t been done — we’re all about what we can do. We’re looking for driven teammates who are ready to jump in and do the same.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Nebo\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNebo is a human-centered agency committed to doing great work and never settling for \"good enough.\" The culture is friendly, the work is rewarding and the Friday beers are cold, because that's the way we like it. Located in West Atlanta, we're at the heart of the Southeast's digital, startup, and marketing scenes. (We also have a stock of Red Bull, fuel of champions.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the position\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a front-end engineer at Nebo, you will bring well-designed website and interfaces to life with carefully crafted HTML and javascript.\u003c/p\u003e\n\u003cp\u003eBe prepared to work with our back-end, design, content and UX teams to maintain and develop features for existing web applications and websites and to build complex user interactions either from scratch or within existing frameworks.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone with 2-5 years of professional coding experience and strong examples of previous work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHere are some of the technologies we use on a daily basis\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJavaScript / JQuery\u003c/li\u003e\n\u003cli\u003eCSS / Sass\u003c/li\u003e\n\u003cli\u003eGit / GitLab\u003c/li\u003e\n\u003cli\u003eNebo CMS (our in-house Content Management System built and maintained by our team!)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills Required\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient in HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003ePortfolio of designed and coded work\u003c/li\u003e\n\u003cli\u003eFamiliar with Adobe creative tools\u003c/li\u003e\n\u003cli\u003eAble to translate user experience and design into clean, modular, and scalable code that follows web standards\u003c/li\u003e\n\u003cli\u003eAttention to detail\u003c/li\u003e\n\u003cli\u003eGood communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThe things that will set you apart (AKA Bonus Skills)\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFamiliar with using Git and version control\u003c/li\u003e\n\u003cli\u003eExperienced in SCSS, Grunt/Gulp\u003c/li\u003e\n\u003cli\u003eAgency or fast-paced work environment experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a full-time position and compensation is dependent upon experience. We're currently working remotely due to COVID-19, but going forward this position will be based in our office located in Atlanta, Georgia.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNebo's Commitment to Diversity \u0026amp; Inclusion\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a human-centered agency, we believe in uplifting our community and advancing society through inclusive business practices. We're dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran’s status.\u003c/p\u003e\n\u003cp\u003eThank you for your interest in Nebo!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:careers@neboagency.com\"\u003ecareers@neboagency.com\u003c/a\u003e\nor apply directly at: \u003ca href=\"https://www.neboagency.com/careers/front-end-engineer/\"\u003ehttps://www.neboagency.com/careers/front-end-engineer/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21PIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac831d86a987231a85808732241c08ae26d044fa/nebo-n-logo.jpg"},{"id":"f27c78a0-7976-452e-a4bc-3e25b86b50b2","type":"Full Time","url":"https://jobs.github.com/positions/f27c78a0-7976-452e-a4bc-3e25b86b50b2","created_at":"Tue Nov 17 20:27:34 UTC 2020","company":"Chess.com","company_url":"http://www.chess.com","location":"Remote","title":"Cloud Engineer / SysOps / Big Data for Millions of Chess Players!","description":"\u003cp\u003eChess.com is looking for someone who is passionate about building \u0026amp; managing infrastructure. We are looking for someone who has the deep experience of a traditional sysadmin, and also the future-oriented skills of managing in a cloud / Kubernetes ecosystem. Our team firmly believes in automating everything and building provisioning scripts to automate all our tasks. We are blending our existing bare-metal datacenter hosting with AWS/GCP for microservices and scaling, and need your help to make sure that we're always up, stable and performant.\u003c/p\u003e\n\u003cp\u003eQUALIFICATIONS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency in managing Kubernetes clusters\u003c/li\u003e\n\u003cli\u003eExperience with AWS or GCP\u003c/li\u003e\n\u003cli\u003eParticular experience with Terraform (we treat Infrastructure as a Code)\u003c/li\u003e\n\u003cli\u003eUNIX/Linux generalist\u003c/li\u003e\n\u003cli\u003eExperience building CI/CD pipelines\u003c/li\u003e\n\u003cli\u003eGood understanding of modern monitoring \u0026amp; logging stack i.e. Prometheus, Cortex, EFK\u003c/li\u003e\n\u003cli\u003e2+ years supporting php/java, mysql, and redis\u003c/li\u003e\n\u003cli\u003eTraditional sysadmin skills of building hosts, monitoring, and capacity planning\u003c/li\u003e\n\u003cli\u003eUnderstanding of networking fundamentals, http, etc\u003c/li\u003e\n\u003cli\u003eComfortable with scripting\u003c/li\u003e\n\u003cli\u003eBonus: Experience with message brokers (e.g. Kafka, PubSub, Redis)\u003c/li\u003e\n\u003cli\u003eBonus: You are interested in building a hybrid on-prem/cloud Service Mesh\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a REMOTE, FULL-TIME position open to anyone in the USA, Canada, Mexico, or Central/South America. You can learn more about us here:\n\u003ca href=\"https://www.chess.com/blog/erik/how-chess-com-s-100-person-virtual-team-works-together\"\u003ehttps://www.chess.com/blog/erik/how-chess-com-s-100-person-virtual-team-works-together\u003c/a\u003e\n\u003ca href=\"https://www.chess.com/about\"\u003ehttps://www.chess.com/about\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease fill out this application form: \u003ca href=\"https://forms.gle/yJmm6N94afxXgjuU6\"\u003ehttps://forms.gle/yJmm6N94afxXgjuU6\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--64f8ff2dd3107505b1b2f59548169df874cc71e4/600x600_pawn_margin.png"},{"id":"c2c8325c-1eb9-48d5-bd0d-2d225b1db6e5","type":"Full Time","url":"https://jobs.github.com/positions/c2c8325c-1eb9-48d5-bd0d-2d225b1db6e5","created_at":"Tue Nov 17 16:51:24 UTC 2020","company":"Bublup, Inc.","company_url":"https://www.bublup.com","location":"Arlington, VA (or remote)","title":"Senior Angular/Angular JS Developer","description":"\u003ch3\u003eThe Job\u003c/h3\u003e\n\u003cp\u003eBublup is hiring software engineers with experience in JavaScript — ideally Angular or AngularJS — to create state of the art interfaces for large-scale and highly interactive applications. Our projects are ground-breaking in terms of how users interact with data and each other. We are looking for people who love to write code, but also have a great imagination.\u003c/p\u003e\n\u003ch3\u003eSkill Areas\u003c/h3\u003e\n\u003cp\u003eWe want talented people who have experience with various technologies for front-end development, and who adapt to whatever the right architecture, languages, and libraries are to build the best total system and deliver the best user experience.\u003c/p\u003e\n\u003ch3\u003eSome Important Skills:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e5+ Years experience in a highly relevant position with demonstrable command of JavaScript.\u003c/li\u003e\n\u003cli\u003eExperience building SPAs. Angular or AngularJS would be a big plus.\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or a related technical field, with strong understanding of programming concepts.\u003c/li\u003e\n\u003cli\u003eSolid understanding and experience of software development tools, including Package Managers, Continuous Integration, Build Tools, Task Runners, Unit Testing, Ticket/Bug Tracking.\u003c/li\u003e\n\u003cli\u003eExperience with responsive design.\u003c/li\u003e\n\u003cli\u003eDemonstrable advanced knowledge of CSS and CSS techniques including css vars, flex, grid, animations, etc.\u003c/li\u003e\n\u003cli\u003eFamiliarity with common CSS frameworks like Material, Bootstrap, etc.\u003c/li\u003e\n\u003cli\u003eBonus points for:\u003c/li\u003e\n\u003cli\u003eFamiliarity with common font icon libraries such as Material Icons, Font Awesome, etc.\u003c/li\u003e\n\u003cli\u003eFamiliarity with fonts and typography.\u003c/li\u003e\n\u003cli\u003eA minor (or experience) in a design related field.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:careers@bublup.com\"\u003ecareers@bublup.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc09PIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fd5aad627c848524f52a88efef732465173f775d/bublup.jpg"},{"id":"cb22cac2-f8f9-4d1b-8802-6f05bb3c3247","type":"Full Time","url":"https://jobs.github.com/positions/cb22cac2-f8f9-4d1b-8802-6f05bb3c3247","created_at":"Tue Nov 17 16:50:30 UTC 2020","company":"Activated Insights","company_url":"https://activatedinsights.com/","location":"Remote","title":"Senior Engineer (Lead) - Software Engineering - REMOTE ","description":"\u003cp\u003e\u003cstrong\u003eAbout Activated Insights:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eActivated Insights’ technology helps senior care providers close the feedback loop with their employees and the seniors that they serve so they can make better decisions and provide better care. Today, our survey and analytics platform supports the voices of over half a million employees, seniors, and family members at over 4,000 locations. Now during the pandemic, we’re helping senior care providers understand their employees’ and their seniors' needs as they face unprecedented challenges.\u003c/p\u003e\n\u003cp\u003eWe’re a close-knit remote team that cares about working hard to do good in the world, while also making sure that we can all live balanced lives. As our user base grows, we’re looking for an experienced engineer to join our team to help scale our platform and expand our product offerings. We’re using data to transform the aging experience of our parents, our grandparents, our loved ones - and ultimately, for ourselves. Come join us!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are seeking a self-motivated, experienced senior software engineer to serve as a technical lead on our remote engineering team. This is an opportunity for someone who wants to be part of a small, hardworking team where everyone is invested and cares about doing well, by doing good. You’ll spend 80% of your time working hands on to build new features and products, 10% using your past experience to help scale our codebase as our user base grows, and 10% providing technical mentoring to engineers on our team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the team:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll be joining a small, but mighty remote engineering team based in the US and in Europe. We have a flat structure and do continuous deployment where each engineer deploys their own work to production at any time and is responsible for what they deploy. While we move quickly and focus on outcomes, we’re invested in PR review as a process and care about quality and standards. Our core stack includes Python, Django, Graphql, React, Typescript, Postgres, Google Cloud Platform, Kubernetes, and Drone.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs a Senior Lead Engineer you will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe in the code building new features and fixing issues.\u003c/li\u003e\n\u003cli\u003eOwn the strategy for scaling our code base as our user base grows.\u003c/li\u003e\n\u003cli\u003eDo PR reviews and give constructive feedback to other engineers on the team.\u003c/li\u003e\n\u003cli\u003eHelp problem solve and figure out solutions when teammates are stuck.\u003c/li\u003e\n\u003cli\u003eDrive short and medium term engineering strategy and planning.\u003c/li\u003e\n\u003cli\u003eSupport teammates as they architect new products and features.\u003c/li\u003e\n\u003cli\u003eAttend daily standups and ad hoc meetings like design reviews.\u003c/li\u003e\n\u003cli\u003eCollaborate closely with other engineers, product, and design.\u003c/li\u003e\n\u003cli\u003eAssist with medium and long term product planning.\u003c/li\u003e\n\u003cli\u003eServe as a technical mentor and source of support for your team members.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou should have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e6+ years of full stack experience on production web apps using web frameworks (Django, Rails, etc.)\u003c/li\u003e\n\u003cli\u003e4+ years experience using Python and Django\u003c/li\u003e\n\u003cli\u003eScaled software to support 10,000s daily active users and a database with 10s of millions of records.\u003c/li\u003e\n\u003cli\u003eExperience using React (in the past 2-3 years), bonus points if you have experience with Typescript.\u003c/li\u003e\n\u003cli\u003eExperience with CI/CD tools like Helm or Drone.\u003c/li\u003e\n\u003cli\u003eHands-on dev ops experience at an early or medium stage startup, bonus points if you have experience with Kubernetes, Docker, and GCP.\u003c/li\u003e\n\u003cli\u003eAbility to balance focusing on output and meeting business needs with maintaining code quality.\u003c/li\u003e\n\u003cli\u003eInterest in providing technical mentorship to a team of motivated peers.\u003c/li\u003e\n\u003cli\u003ePassionate about software development, you do this because you love it.\u003c/li\u003e\n\u003cli\u003eYou love the small team startup environment and working hard and fast to have a big personal impact.\u003c/li\u003e\n\u003cli\u003eThrive when working remotely.\u003c/li\u003e\n\u003cli\u003eBased in the US or Europe - can work hours overlapping with 9-3 pm EST\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIn addition to “doing well by doing good”, we offer:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePay: Competitive salaries + stock.\u003c/li\u003e\n\u003cli\u003eStock options: Ownership in a fast-growing company.\u003c/li\u003e\n\u003cli\u003e401k: We care about your ability to save for your future.\u003c/li\u003e\n\u003cli\u003eTime Off: Flexible vacation policy to encourage you to take care of your whole self.\u003c/li\u003e\n\u003cli\u003eRemote-First: Choose when and where you work best, just make sure you overlap with your teammates.\u003c/li\u003e\n\u003cli\u003eHealthcare: Competitive medical, dental, and vision policies.\u003c/li\u003e\n\u003cli\u003eGoodies: $2,000 towards hardware and software you need to get the job done.\u003c/li\u003e\n\u003cli\u003eGreat team: Working with fun, hardworking, nice people who are committed to making a difference!\u003c/li\u003e\n\u003cli\u003e...And much more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are an equal opportunity employer and are committed to building a company that embraces and celebrates diversity and inclusion. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status. As a women-founded company we’re committed to building a diverse team because we know it’s not just good business sense, but the right thing to do.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:cwalraven@activatedinsights.com\"\u003ecwalraven@activatedinsights.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0dPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0b8d85dbc9410077e97964776aef95a4ab252753/AI-GPTW-logo%20JPG.jpg"},{"id":"cc872898-ec1f-4602-b1af-b2616307b74c","type":"Full Time","url":"https://jobs.github.com/positions/cc872898-ec1f-4602-b1af-b2616307b74c","created_at":"Tue Nov 17 14:27:32 UTC 2020","company":"Pagaya","company_url":"https://www.pagaya.com/","location":"Tel Aviv","title":"Data Engineer Tech Lead","description":"\u003cp\u003e8+ years of relevant industry experience.\nComfortable with Python\nExperience with big data tools: Hadoop, Spark, Kafka, etc.\nExperience with AWS cloud services: EC2, RDS, ECS, S3\nExperience with database architecture\nTechnical leadership with respect to design, implementation and overseeing complex technical processes.\nBuilding and designing large-scale applications\nAdvanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.\nStrong analytic skills related to working with unstructured datasets.\nWillingness to get your hands dirty, understand a new problem deeply, and build things from scratch when they don't already exist\nUndergraduate degree in Computer Science, Computer Engineering, or similar disciplines from rigorous academic institutionsPagaya is a leading next-generation asset management firm founded in 2015. Combining advanced technology and financial expertise, we use artificial intelligence and state-of-the-art algorithms to uncover exceptional, low-risk high-yield opportunities in alternative credit for investors. Pagaya actively invests in US consumer credit assets.\u003c/p\u003e\n\u003cp\u003eThe Pagaya team is comprised of over 100 professionals in New York and Tel Aviv with expertise in artificial intelligence, data rich alternative assets and asset management. The team manages over $1.7 billion in assets on behalf of institutional investors around the world.\u003c/p\u003e\n\u003cp\u003ePagaya just completed its Series D financing of over $100M led by a prominent sovereign wealth fund.\u003c/p\u003e\n\u003cp\u003eSoftware is fundamental to research. From the humanities to physics, biology to archaeology, software plays a vital role in generating results. The Data Engineering team is a cross-functional team responsible for data integration, monitoring, and quality. This includes automating data monitoring, alerting, fetching, and checking across various stages of data transformation and projection. The team serves vital functions to aid and advocate all departments with quality data.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cp\u003eStrong technical leadership in supervising, planning, and delivering highly complex projects and Maintenance requests consisting of a large number of deliverables, and complex dependencies.\nBuild data architecture for ingestion, processing, and surfacing of data for large-scale applications\nExtract data from one database and load it into another\nUse many different scripting languages, understanding the nuances and benefits of each, to combined systems\nIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\nLead the entire software lifecycle including hands-on development, code reviews, testing, deployment, and documentation for all ETL's\nKeep our data separated and secure across national boundaries through multiple data centers and AWS regions.\nCreate data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.\nCreate and maintain optimal data pipeline architecture\nWork with other members of the data team, including data architects, data analysts, and data scientists\nKey Takeaways:\u003c/p\u003e\n\u003cp\u003eUse the tools and languages that are best suited to the job - Complete flexibility to problem-solving with novelty and creativity encouraged\nOpen source projects and frameworks recommended\nBe around very bright and lovely people\nIt's all about results - working hours are not the focus\nYour intellectual curiosity and hard work contributions will be welcome to our culture of knowledge sharing, transparency, and shared fun and achievement\nProvide education and documentation enabling fellow team members to maximize technical resources\nContribute to our software engineering culture of writing correct, maintainable, elegant and testable code\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eemail your CV:\n\u003ca href=\"mailto:pagaya.C1.A1C@applynow.io\"\u003epagaya.C1.A1C@applynow.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjZPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--032feae4a6a578e9f3082be9813a28af17028bea/logo%20pagaya(1).JPG"},{"id":"79ef9c3e-487f-4b0e-8fbf-9af66542b3f1","type":"Full Time","url":"https://jobs.github.com/positions/79ef9c3e-487f-4b0e-8fbf-9af66542b3f1","created_at":"Tue Nov 17 14:15:44 UTC 2020","company":"Pon Digital Solutions","company_url":null,"location":"Zuiderslag 2, 3833 BP, Leusden","title":"Senior Front End Developer","description":"\u003cp\u003e\u003cstrong\u003eBen jij diegene die moderne, creatieve en functionele front-end applicaties ontwikkelt?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Senior Front End Developer ontwikkel je dagelijks moderne, creatieve en functionele front-end applicaties die écht het verschil maken en worden gebruikt door grote groepen eindgebruikers. Daarnaast help en coach je Junior Front End Developers.\u003c/p\u003e\n\u003cp\u003eVoordat een project start, kies je samen met je team de technologieën die jullie willen gebruiken (je kunt deze keuze uiteraard goed beargumenteren). Bij het maken van de code bouw je, waar het kan, ‘reusable high performance code’ en deelt deze, samen met je kennis, met je collega’s waar het kan.\u003c/p\u003e\n\u003cp\u003eNaast de projectwerkzaamheden lever je een bijdrage aan Pon Digital Solutions: een scale-up binnen een corporate omgeving. Het team bestaat uit 20 enthousiaste specialisten en developers. Echte vakmensen van A-kwaliteit, waarmee je goed kunt sparren.\u003c/p\u003e\n\u003cp\u003eEn oh ja, we werken volledige Agile, op basis van scrum en hebben iedere maand een innovatiedag waar we bouwen aan onze eigen innovatieve oplossingen.\u003c/p\u003e\n\u003cp\u003eBekijk onze video voor meer informatie: \u003ca href=\"https://www.youtube.com/watch?v=wf8drvVRgp4\"\u003eWerken bij Pon Digital Solutions\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat vragen we van jou\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOm deze rol succesvol uit te voeren, is het belangrijk dat je een gepassioneerde developer bent: je krijgt energie van mooie oplossingen bouwen. Je bent continu aan het leren en houdt de community goed in de smiezen.\u003c/p\u003e\n\u003cp\u003eVerder vragen we:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKennis van (één van) de nieuwste technologieën: React Native, Angular 2+, Vue JS, Node, Webpack en/of CI/CD\u003c/li\u003e\n\u003cli\u003eErvaring als Front End Developer\u003c/li\u003e\n\u003cli\u003eAffiniteit met coaching om Junior Developers te ondersteunen waar nodig\u003c/li\u003e\n\u003cli\u003eDat je je gezonde verstand gebruikt om de beste oplossingen voor klanten te vinden\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat bieden wij\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBehalve dat je de hele dag voor de mooiste merken werkt, krijg je samen met je team de tijd om te innoveren en kun je doorgroeien tot Full Stack Developer wanneer je dat wilt.\u003c/p\u003e\n\u003cp\u003e‘Make it Fun’ is één van onze kernwaarden en bij Pon kun je rekenen op uitstekende arbeidsvoorwaarden:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen (meer dan) marktconform salaris (tussen de €4.000,- en €5.500,-), met goede bonusregeling van max. 15%\u003c/li\u003e\n\u003cli\u003eEen flexibele werkplek. Werken waar je wil; vanuit huis, op kantoor of ergens anders. We vinden het belangrijk om fysiek samen te komen tijdens team meetings\u003c/li\u003e\n\u003cli\u003e20 vakantiedagen per jaar op basis van een fulltime dienstverband\u003c/li\u003e\n\u003cli\u003eEen individueel keuze budget op basis van 13 vakantiedagen, 8% vakantiegeld en EUR 300,- bruto werkgeversbijdrage ONVZ (indien van toepassing)\u003c/li\u003e\n\u003cli\u003eCYOD: kies zelf je device (laptop en telefoon)\u003c/li\u003e\n\u003cli\u003eEen goede pensioenregeling van Pon\u003c/li\u003e\n\u003cli\u003eEen collectieve zorgverzekering bij ONVZ\u003c/li\u003e\n\u003cli\u003ePon Fit: doe mee aan bootcamps, fiets- en wielerrondes, hardloopevents, hockey, golfclinics en nog veel meer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOver de organisatie\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePon Digital Solutions bedenkt, ontwerpt en bouwt software voor de merken van Pon: van Gazelle en Caterpillar tot Skoda en Volkswagen. We bouwen onder andere aan webshops, workflow engines, API’s, mobile apps, IoT-oplossingen en websites. Ons doel? Digitale innovatie binnen Pon stimuleren én realiseren!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOverige informatie\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHeb je nog vragen? Neem dan contact op met Gabriella Serreli via 06-53927769 of \u003ca href=\"mailto:gabriella.serreli@pon.com\"\u003egabriella.serreli@pon.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSollicitatieprocedure\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDe sollicitatieprocedure ziet er als volgt uit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAls je hebt gesolliciteerd, ontvang je zo snel mogelijk een reactie van ons.\u003c/li\u003e\n\u003cli\u003eHet eerste gesprek is met Gabriella en Zeger (de technical lead van Digital Solutions).\u003c/li\u003e\n\u003cli\u003eVervolgens doe je een assessment waar één van de leads bij aanschuift.\u003c/li\u003e\n\u003cli\u003eAls de uitslag van je assessment positief is, krijg je uiterlijk de volgende dag een voorstel van ons.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe gemiddelde doorlooptijd van de sollicitatieprocedure is 2-3 weken.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAcquisitie op basis van deze vacature wordt niet op prijs gesteld.\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eJe kan direct je cv en motivatie sturen door \u003ca href=\"https://vonq.io/3lFl3GH\"\u003e\u003cstrong\u003ehier\u003c/strong\u003e\u003c/a\u003e  te klikken.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnlPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c4848156a18f7f4b0d3f3f81c7ec6225c8b9af68/Pon_logo.jpg"},{"id":"84ce113a-e72f-409e-a54c-965d39372a27","type":"Full Time","url":"https://jobs.github.com/positions/84ce113a-e72f-409e-a54c-965d39372a27","created_at":"Fri Oct 16 14:32:54 UTC 2020","company":"AXIOS","company_url":"http://axios.com","location":"New York, NY | Arlington, VA | Remote (US)","title":"Engineering Manager (Front-End)","description":"\u003cp\u003eQuick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We are hiring an Engineering Manager to lead and manage a team of Axios engineers.\u003c/p\u003e\n\u003cp\u003eWhy it Matters:  Our engineering team is a critical component to delivering on our mission to provide the cleanest, smartest, most efficient and trustworthy content and technology to our audience and customers. We are looking for an Engineering Manager with deep domain knowledge of front-end and front-end mobile technologies to help scale our organization, provide management and coaching, and support our teams to deliver against their product roadmaps.\u003c/p\u003e\n\u003cp\u003eGo Deeper: In this role, you will make an impact to Axios through the following responsibilities:\u003c/p\u003e\n\u003cp\u003eCoach, mentor, and grow Axios engineers\nProvide regular, timely, and candid feedback, as well as participate in monthly career check-ins, performance evaluations, and advancement reviews \nPlay a lead role in delivering against team personal and team OKRs\nEnsure the psychological safety of Axios staff \nDrive the tech organization forward by exploring potential technology solutions, keeping up-to-date on trends and security vulnerabilities, and propose ways to evolve our platform and products\nEstablish, evangelize, and reinforce best practices and patterns \nServe as a leader in developing and reviewing architectural and technical decisions \nOwn our front-end chapter and look for ways to keep engineers engaged, learning, and excited\u003c/p\u003e\n\u003cp\u003eThe Details: Ideal candidates will embody an entrepreneurial spirit, high EQ, and passion for Axios’ mission, as well as have the following skills:\u003c/p\u003e\n\u003cp\u003eExperience leading and managing a cross-functional team of engineers in a fast-paced and high-growth environment\nDeep, current technical knowledge with software development, architecture, data design and implementation\nProven track record of creating pragmatic, maintainable systems, using industry-recognized best practices\nExperience shipping, maintaining, and evolving  highly-utilized production products \nDeep experience applying agile practices to streamline team delivery and output\nExperience with frontend technologies, specifically React and React Native\nA passion for your craft, a desire to continue to learn and grow, and dedication to the growth and development of others\nServant-leader mindset\u003c/p\u003e\n\u003cp\u003eDon’t forget: \u003c/p\u003e\n\u003cp\u003eCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\nAnnual learning and development stipend\u003c/p\u003e\n\u003cp\u003eAdditional pandemic-related benefits:\u003c/p\u003e\n\u003cp\u003eOne mental health day per month\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/f70a16161us\"\u003ehttps://grnh.se/f70a16161us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUdNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3556c64d578da1e6162a31ae21b416d249d9cd50/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"},{"id":"90ea52d5-230d-4f82-a406-aa7fba7af0f2","type":"Full Time","url":"https://jobs.github.com/positions/90ea52d5-230d-4f82-a406-aa7fba7af0f2","created_at":"Fri Oct 16 14:28:19 UTC 2020","company":"Axios","company_url":"http://Axios","location":"Remote (USA)","title":"Senior Mobile Engineer (React Native)","description":"\u003cp\u003eQuick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We are hiring a Senior Mobile Engineer! \u003c/p\u003e\n\u003cp\u003eWhy it Matters: Our Mobile Engineers are a critical part of our mission to deliver the cleanest, smartest, most efficient and trustworthy content to our users. You will architect and grow new and existing codebases, give technical input and feedback to Axios’ product and design teams for new features, and help develop the skills of your teammates with industry best practices around testing, accessibility, and documentation.\u003c/p\u003e\n\u003cp\u003eGo Deeper: In this role, you will make an impact on Axios through the following responsibilities:\u003c/p\u003e\n\u003cp\u003eHelp architect and build significant new features in the Axios mobile app\nPartner with Senior Mobile, Frontend and React Native engineers on the team\nWrite clean, well-documented, and well-tested code using best practices for React and React Native development\nCollaborate with Axios’ platform, product, and design teams to ensure we quickly ship and iterate on high-quality products\nDebug and develop mobile platform-specific features on iOS and Android in a React Native codebase\nMentor and coach members of the team through pair-programming and empathetic code review\nStay up to date with industry trends and advise the team on best practices to implement\u003c/p\u003e\n\u003cp\u003eThe Details: Ideal candidates will embody an entrepreneurial spirit and passion for Axios’ mission and have the following skills:\u003c/p\u003e\n\u003cp\u003eExperience building large, high traffic frontend codebases in React Native\nProven ability to ship high quality, testable, and accessible code quickly\nExperience working on cross-functional teams is preferred\nExperience working on mobile performance and accessibility is preferred\nExperience debugging mobile applications on iOS and Android is preferred\u003c/p\u003e\n\u003cp\u003eDon’t Forget:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\u003c/p\u003e\n\u003cp\u003eAdditional pandemic-related benefits:\u003c/p\u003e\n\u003cp\u003eOne mental health day per month\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/ce61b26c1us\"\u003ehttps://grnh.se/ce61b26c1us\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"0a6c6784-fc9f-4812-884f-00a6bf6f5bad","type":"Full Time","url":"https://jobs.github.com/positions/0a6c6784-fc9f-4812-884f-00a6bf6f5bad","created_at":"Mon Nov 16 23:24:16 UTC 2020","company":"Concert Health","company_url":"http://concerthealth.io","location":"Remote","title":"Senior Salesforce Developer","description":"\u003cp\u003eConcert Health is a rapidly growing behavioral healthcare services organization. The team includes experienced entrepreneurs, nationally recognized clinical pioneers and top flight health-tech investors including Healthy Ventures, Town Hall Ventures, Vertical Venture Partners, and Edward Bergmark.\u003c/p\u003e\n\u003cp\u003eWe provide behavioral health services to primary care organizations using an evidence-based model, Collaborative Care.  We employ a growing team of talented, mission-driven clinicians, empowered by a modern technology platform. Collaborative Care has been shown to be effective, and is supported by Medicare, most commercial health plans, and Medicaid in many states. You can learn more about the model here.\u003c/p\u003e\n\u003cp\u003eWe're looking for a talented Senior Salesforce Developer who will partner with our Product Team to expand our Salesforce Service Cloud Care Management Platform - empowering our clinical team to provide excellent care at scale. Our vision is a unified technology experience for clinicians and patients that brings together electronic medical record (EMR) data, our care management platform, patient engagement tools, and healthcare data analytics. Your ability to create elegant solutions to complex business problems - using Salesforce.com configuration and development tools and leveraging APIs for third-party integrations - will be integral to achieving that vision.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBecome an expert on our care delivery model, the systems that enable it, and requirements to drive growth and support scale\u003c/li\u003e\n\u003cli\u003eProvide strategic direction in the areas of build vs. buy/integrate, technology stack and architecture, data science, machine learning, and analytics\u003c/li\u003e\n\u003cli\u003eDevelop in Apex, Visualforce, Lightning, Java, and other technologies to build customized solutions that support business requirements and drive key business decisions\u003c/li\u003e\n\u003cli\u003eWrite and maintain high-quality code, with high test coverage, following rigorous processes, standards, and methodologies\u003c/li\u003e\n\u003cli\u003eBuild for scale: define initiatives to improve infrastructure, reduce technical debt, and decrease system complexity; aggressively govern our data model\u003c/li\u003e\n\u003cli\u003ePerform technical analysis, level-of-effort estimation, design, development, implementation of applications with necessary customizations and integration\u003c/li\u003e\n\u003cli\u003eTroubleshoot and fix defects for planned releases and production issues\nMentor members of the team to maximize overall productivity and effectiveness of the team\u003c/li\u003e\n\u003cli\u003eBe comfortable with modern software development lifecycle best practices including iterative and incremental development, delivering working software frequently with attention to technical excellence\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Skills \u0026amp; Experience:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of Salesforce development experience using Apex, Visualforce, Lightning component frameworks, triggers, batch apex and Salesforce APIs\u003c/li\u003e\n\u003cli\u003eDemonstrated success integrating Salesforce.com with other applications using SOAP, REST, BULK and Streaming APIs\u003c/li\u003e\n\u003cli\u003eIn-depth understanding of the architecture, capabilities and constraints of the SFDC CRM application coupled with good understanding of business processes\u003c/li\u003e\n\u003cli\u003eExperience in building complex, scalable, and high-performance software systems that have been successfully delivered to customers\u003c/li\u003e\n\u003cli\u003eDemonstrated success with advanced Apex programming concepts including core design patterns, limits and bulk patterns, efficient and reliable trigger handling, asynchronous operations and effective unit testing\u003c/li\u003e\n\u003cli\u003eDemonstrated ability to lead architectural decisions, and to analyze, build, and extend stack as required for commercialization\u003c/li\u003e\n\u003cli\u003eStrong problem-solving skills with the ability to work cross-functionally in a fast-paced and rapidly changing work environment either on a team or as an individual contributor\u003c/li\u003e\n\u003cli\u003eStrongly opinionated and pragmatic, but respectful and collaborative\u003c/li\u003e\n\u003cli\u003eSelf-motivated with strong interpersonal and communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus Points for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with cloud or on-premise middleware and other enterprise integration technologies\u003c/li\u003e\n\u003cli\u003eSalesforce certifications: Salesforce Platform Developer II (PDII) or equivalent experience,* Salesforce Administrator, Salesforce Platform App Builder or equivalent experience, etc.\u003c/li\u003e\n\u003cli\u003eExposure to healthcare and experience/understanding of the healthcare IT ecosystem (especially behavioral healthcare) and understanding of related systems, such as electronic medical records (EMRs)\u003c/li\u003e\n\u003cli\u003eFamiliarity w/ healthcare interoperability standards such as FHIR, HL7\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply using the following link:\n\u003ca href=\"https://boards.greenhouse.io/concerthealth/jobs/2442154\"\u003ehttps://boards.greenhouse.io/concerthealth/jobs/2442154\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmVPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fbbfdc966d714672fb4ed00c466e6455310da52c/Capture.JPG"},{"id":"ff3ea8e4-57e4-4fc6-a7c5-6c2c9ab36def","type":"Full Time","url":"https://jobs.github.com/positions/ff3ea8e4-57e4-4fc6-a7c5-6c2c9ab36def","created_at":"Mon Nov 16 21:57:35 UTC 2020","company":"Agiloft","company_url":"http://www.agiloft.com","location":"Kyiv, Ukraine, Budapest, Hungary, Russia, India, Philippines","title":"Senior Integration Developer (Remote, Outside US)","description":"\u003cp\u003e\u003cstrong\u003eThrive with Agiloft\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Integration Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable, and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is looking for an experienced integrations developer with experience in building Salesforce applications to take charge of Agiloft’s fast-growing integration ecosystem.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Join Agiloft?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAgiloft was named as the market leader in every category in the Gartner Critical Capabilities for CLM report, and a market leader in the Gartner Magic Quadrant. Contract Lifecycle Management (CLM) is one of the fastest-growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/li\u003e\n\u003cli\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over a dozen awards, including the Editor's Choice award from PC Mag, for the past five years in a row.\u003c/li\u003e\n\u003cli\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprise: pre-built applications with a deeply configurable, no-code platform for integrated BPM throughout an organization.\u003c/li\u003e\n\u003cli\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/li\u003e\n\u003cli\u003eWe guarantee our customer’s success, and you too will be successful with Agiloft.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will be a key member of the Agiloft engineering team responsible for delivering data integration projects. You will be actively engaged in all aspects of the solution lifecycle, including design, development, support, and ongoing maintenance. While there are many different applications and iPaaS platforms we integrate with, many of our customers need to integrate Agiloft with Salesforce. You will be a perfect fit for the open position if you also have experience with building or modifying Salesforce applications.\u003c/p\u003e\n\u003cp\u003eYou should have no less than three years of professional experience in building enterprise-grade applications with a focus on integrations and API and one year plus experience with Apex applications. We expect you to be passionate about building software and perform well working in a geographically distributed and diverse team.\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTranslating business requirements into technical requirements and developing the necessary integration or application to fulfill those requirements.\u003c/li\u003e\n\u003cli\u003eCode produced will primarily be, but is not restricted to, REST APIs and integration orchestrations.\u003c/li\u003e\n\u003cli\u003eWrite Apex routines or modify existing Apex routines for Agiloft customers\u003c/li\u003e\n\u003cli\u003eDocumenting code for maintenance and reusability.\u003c/li\u003e\n\u003cli\u003eUnderstanding existing code and performing maintenance and enhancements as required.\u003c/li\u003e\n\u003cli\u003eWorking with other teams to promote standards and code reuse across the organization.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava Developer\u003c/li\u003e\n\u003cli\u003eWeb Services (REST \u0026amp; SOAP)\u003c/li\u003e\n\u003cli\u003eRESTful API design and JSON data representation\u003c/li\u003e\n\u003cli\u003eExperience with J2EE, Tomcat, JBoss, EJB3 is a plus\u003c/li\u003e\n\u003cli\u003eExperience in Multi-threading is plus\u003c/li\u003e\n\u003cli\u003eRelational databases\u003c/li\u003e\n\u003cli\u003eExperience with Salesforce Apex\u003c/li\u003e\n\u003cli\u003eExperience working in geographically dispersed teams\u003c/li\u003e\n\u003cli\u003eBachelor’s Degree\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGood understanding of current database technologies and their applications\u003c/li\u003e\n\u003cli\u003eHands-on experience with building Salesforce applications\u003c/li\u003e\n\u003cli\u003eA keen interest to learn about new technologies\u003c/li\u003e\n\u003cli\u003eFluent in the English language\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTo Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor immediate consideration, visit our website: \u003ca href=\"https://tinyurl.com/y3rvqlko\"\u003ehttps://www.agiloft.com/SrIntegration\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, visit our website: \u003ca href=\"https://tinyurl.com/y3rvqlko\"\u003ehttps://www.agiloft.com/SrIntegration\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcldPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--43217fc7363891dfd5e10d398280a3e235d16e16/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"35653573-d7f2-4489-94ea-ce446ecdf465","type":"Full Time","url":"https://jobs.github.com/positions/35653573-d7f2-4489-94ea-ce446ecdf465","created_at":"Mon Nov 16 13:48:54 UTC 2020","company":"Localist","company_url":"https://www.localist.com","location":"Remote","title":"Full Stack Ruby Developer","description":"\u003ch1\u003eDescription\u003c/h1\u003e\n\u003cp\u003eHumans are born for connection\u003c/p\u003e\n\u003cp\u003eLocalist is \u003cstrong\u003ebuilt to connect\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLocalist is a first of its kind community event platform for brands. Our mission is to help organizations leverage the power of events to spark ideas and spur movements. Our team thinks big, dreams big and delivers big. This is an excellent opportunity to join a high energy company with a dynamic team culture, at just the right time.\u003c/p\u003e\n\u003cp\u003etime.\u003c/p\u003e\n\u003ch2\u003eWhat you’ll do:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eLead contributions to Localist, our flagship event CMS. Localist is a large Rails app that requires fluency in Javascript and web technologies: Ruby, Rails, ReactJS, HTML, CSS, MySQL.\u003c/li\u003e\n\u003cli\u003eShip simple, approachable, performant, testable code.\u003c/li\u003e\n\u003cli\u003eCommunicate your recommended solutions and work to balance constraints in the short-term to reach your vision for the user in the long-term.\u003c/li\u003e\n\u003cli\u003eFacilitate multiple types of research, identify customer pain points, and ensure usability of new designs.\u003c/li\u003e\n\u003cli\u003eCollaborate with the head of product to ensure consistency across products, embrace our UX standards, best practices, styles, patterns, and guidelines as well as contribute to our design system.\u003c/li\u003e\n\u003cli\u003eFacilitate and make informed technical decisions that drive the long term vision of connecting communities through events.\u003c/li\u003e\n\u003cli\u003eBuild workflow tools that enable our customers and event admins to publish beautiful event content faster and easier.\u003c/li\u003e\n\u003cli\u003eSolve complex architecture problems in an extensible, maintainable way. Brings clarity to complex technical problems across the organization.\u003c/li\u003e\n\u003cli\u003eWork closely on new features with others on the product team.\u003c/li\u003e\n\u003cli\u003eMentor your fellow product team members, participating in code reviews and working hand-in-hand with other developers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of experience developing user interfaces for large scale applications, utilizing Ruby, Rails, ReactJS, HTML, CSS, MySQL\u003c/li\u003e\n\u003cli\u003eAble to write approachable, performant code with comprehensive tests and thorough documentation.\u003c/li\u003e\n\u003cli\u003eLove to make your customers and colleagues jobs easier through automation.\u003c/li\u003e\n\u003cli\u003eKeep the big picture in mind, and strive to solve the root problem.\u003c/li\u003e\n\u003cli\u003eDeep understanding of \"designing for grandma,\" employing best-practice UX patterns, simplifying complex problems that require the least amount of UI possible.\u003c/li\u003e\n\u003cli\u003eExperience developing a product from concept to launch (if you have public examples of existing products, that’s a huge plus).\u003c/li\u003e\n\u003cli\u003eExperience collaborating with product managers, designers, and engineers.\u003c/li\u003e\n\u003cli\u003eExperience developing user interfaces using a client-side technology such as React and Redux.\u003c/li\u003e\n\u003cli\u003eProficiency and ability to mentor others in web technologies.\u003c/li\u003e\n\u003cli\u003eExperience in authoring UI for single page applications that meet WCAG 2.0 AA web accessibility standards to support customers who use assistive technologies.\u003c/li\u003e\n\u003cli\u003eExpertise in design patterns, unit tests, and version control systems, especially git.\u003c/li\u003e\n\u003cli\u003eSolid experience implementing features from style guides and user stories.\u003c/li\u003e\n\u003cli\u003eStrong written and verbal communication skills.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive wages and flexible schedules\u003c/li\u003e\n\u003cli\u003eGenerous benefits package including:\u003c/li\u003e\n\u003cli\u003e100% paid medical, dental, vision\u003c/li\u003e\n\u003cli\u003e401(k) with company match\u003c/li\u003e\n\u003cli\u003eLife insurance\u003c/li\u003e\n\u003cli\u003eLong/short-term disability insurance\u003c/li\u003e\n\u003cli\u003e21 days PTO\u003c/li\u003e\n\u003cli\u003e4 paid days per year to volunteer for a not-for-profit of your choice\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply at \u003ca href=\"https://apply.workable.com/localist/j/F658FD35BE/\"\u003ehttps://apply.workable.com/localist/j/F658FD35BE/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcktPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a432bd0282ef2a2b2899e84d03e53c31cb31f02e/localist-logo(1).png"},{"id":"5d0830f9-bd16-4432-93c2-6ceca815b4c1","type":"Full Time","url":"https://jobs.github.com/positions/5d0830f9-bd16-4432-93c2-6ceca815b4c1","created_at":"Tue Sep 15 15:36:10 UTC 2020","company":"Sticker Mule","company_url":"https://www.stickermule.com/careers","location":"Anywhere","title":"Go engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Sticker Mule\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\u003c/p\u003e\n\u003cp\u003eThe Machinery team is responsible for building and maintaining our printing and automation services.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.stickermule.com/about\"\u003eSee more about our teams here\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eRemote work with flexible schedules\u003c/li\u003e\n\u003cli\u003eVaried, interesting technical challenges to solve\u003c/li\u003e\n\u003cli\u003eA fun \"no bullshit\" work environment\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWe like you to know\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGo\u003c/li\u003e\n\u003cli\u003eGoogle Cloud\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eFamiliarity with C++ and C#\u003c/li\u003e\n\u003cli\u003eExcellent communication skills (English)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent practical experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eChallenges\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eMigrate key machinery services from C++ to Go\u003c/li\u003e\n\u003cli\u003eGuide software engineers on Go best practices\u003c/li\u003e\n\u003cli\u003eImprove performance of automation algorithms\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and benefits\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e$99,000-$135,000+\u003c/li\u003e\n\u003cli\u003e$10,000 signing bonus\u003c/li\u003e\n\u003cli\u003e4 weeks vacation\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eApply here only:\u003c/strong\u003e \u003ca href=\"https://www.stickermule.com/career/479b76fe-10cb-4624-a2e6-4a9cc65c55fa\"\u003ehttps://www.stickermule.com/career/479b76fe-10cb-4624-a2e6-4a9cc65c55fa\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWFLIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3cc490f1396a37499b004905f027a5448a03162/herman%206.jpg"},{"id":"b3cd3c4d-90a2-4546-bdcc-87e09cc0143d","type":"Full Time","url":"https://jobs.github.com/positions/b3cd3c4d-90a2-4546-bdcc-87e09cc0143d","created_at":"Mon Nov 16 09:55:25 UTC 2020","company":"Onemedia Consulting GmbH","company_url":"https://onemedia-consulting.com/","location":"Munich","title":"Senior UI Engineer, React (Typescript)","description":"\u003cp\u003eOnemedia Consulting is a young start-up company located in the East of Munich that is focused on Marketing Technology Consulting, enabling our customers in the area of Marketing Strategy, Marketing-Operations, and Marketing-Analytics \u0026amp; Optimization.\u003c/p\u003e\n\u003cp\u003eAs a certified Marketo partner, — a leading CRM Lead Management solution — we are specialized in supporting our clients in the implementation process of marketing automation systems and lead management solutions.\u003c/p\u003e\n\u003cp\u003eIn meeting our clients’ requirements, we offer them a flexible model of collaboration, either as an integral part of their team, as a specialist for a certain time or selective as required. Our clients come from different industries: Healthcare, Automotive, Manufacturing, etc. We do not believe in the traditional agency model but rather hand on our knowledge to our customers in a collaborative way. The past has shown the success of our model, accompanying well-known companies such as Carl Zeiss, Konica Minolta or A1 Digital in their Lead Management process.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs an early UI engineer on the UI engineering team, you will work in a small team that is focused on creating great user experiences. The team builds and maintains multiple user-facing tools that lets customers not only define and monitor the transformations they want but also see and interact with their unified data. You'll be part of a team that is building powerful, highly interactive and user-focused user interfaces using industry best practices and technologies.\u003c/p\u003e\n\u003cp\u003eSome of the specific things you will do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOwn the design and implementation of new features or enhance existing features from concept through to production.\u003c/li\u003e\n\u003cli\u003eInvestigate and fix issues reported by customers.\u003c/li\u003e\n\u003cli\u003eMaintain internal systems to efficiently operate user-facing systems and services.\u003c/li\u003e\n\u003cli\u003eBring up new ideas for the product or architecture and demo them internally\u003c/li\u003e\n\u003cli\u003eWe believe in using the best tool for the job.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExtensive experience building applications with React using Typescript, CSS-in-JS, and SSR, e.g. using Next.js.\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration and build tooling.\u003c/li\u003e\n\u003cli\u003eExperience implementing a new front-end architecture.\u003c/li\u003e\n\u003cli\u003eAbility to convert complex designs into modular components.\u003c/li\u003e\n\u003cli\u003eAbility to write documented, optimal and reliable code.\u003c/li\u003e\n\u003cli\u003eA need to own things end-to-end.\u003c/li\u003e\n\u003cli\u003eUnderstanding of modern cloud infrastructure and technologies, preferably in Azure.\u003c/li\u003e\n\u003cli\u003eAbility to get out of the comfort zone and explore areas beyond the existing skill set.\u003c/li\u003e\n\u003cli\u003ePassionate about design and excited about the prospect of making enterprise software.\u003c/li\u003e\n\u003cli\u003eInitiative and motivation to make things happen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMolequle is designed to be one highly performant platform to collect, store and unify data from a variety of systems. It changes the fabric of organizations by helping them to bond their atomic data. Our customers can write their own integrations or utilize a range of integrations to existing systems.\u003c/p\u003e\n\u003cp\u003ePowerful and highly interactive user interfaces show data and also allow organizations to interact with other systems.\u003c/p\u003e\n\u003cp\u003eWe're looking for talented engineers who are passionate about building world-class experiences and are offering:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYoung, driven team with flat hierarchies\u003c/li\u003e\n\u003cli\u003eFlexible working environment\u003c/li\u003e\n\u003cli\u003eChance to have a big impact on a young company’s development\u003c/li\u003e\n\u003cli\u003eHigh responsibility from day one and challenging tasks with an extremely steep learning curve\u003c/li\u003e\n\u003cli\u003eNice office with good connection to all locations in Munich\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLet us create and form Molec(q)ules together.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/c69170e1eb070349fdd9168d1f380432a067222d/68747470733a2f2f742e676f686972696e672e636f6d2f682f36626531616464643964653733623762303039383030356636303738326132326634613232373362353530343734663761623063643239376535333638303638\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/17ff5b237d47b5f14547a820cbfe420e154bda8d889ea85166bf5b28e08e966a\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--859097cd1d7061780568fec516bd9f63411cb3f7/Onemedia.png"},{"id":"2dcc5f63-2d79-42fe-b2d1-d3a0a7a33459","type":"Full Time","url":"https://jobs.github.com/positions/2dcc5f63-2d79-42fe-b2d1-d3a0a7a33459","created_at":"Mon Nov 16 09:23:46 UTC 2020","company":"InnoGames GmbH","company_url":"https://www.innogames.com","location":"Hamburg","title":"Frontend Developer (Haxe) - Video Game: Forge of Empires","description":"\u003cp\u003eOur agile and cross-functional \u003cstrong\u003eForge of Empires\u003c/strong\u003e team is searching for a \u003cstrong\u003eFrontend Developer\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAs a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.\u003c/p\u003e\n\u003cp\u003eAre you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to the continuous development and improvement of one of our keystone games\u003c/li\u003e\n\u003cli\u003eDevelop new features and improve existing game features with a strong focus on UI and UX\u003c/li\u003e\n\u003cli\u003eParticipate in the whole feature development lifecycle with a commitment to high-quality results\u003c/li\u003e\n\u003cli\u003eCollaborate closely with Mobile- \u0026amp; Backend Developers, Game Designers, and Artists to implement new game features for our browser clients\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour skillset:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.\u003c/li\u003e\n\u003cli\u003eA right eye for details and a passion for implementing UI and UX\u003c/li\u003e\n\u003cli\u003eWell-versed in design patterns and software architecture\u003c/li\u003e\n\u003cli\u003eExperience with writing browser automation tests\u003c/li\u003e\n\u003cli\u003eSolution-oriented and efficient style of work\u003c/li\u003e\n\u003cli\u003eTeam player and a good communicator with fluent English language skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eFavorable\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for online games (strategy/F2P) and knowledge of relevant game mechanics\u003c/li\u003e\n\u003cli\u003eProfessional experience in the gaming industry, ideally working on comparable browser games\u003c/li\u003e\n\u003cli\u003eTheoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies\u003c/li\u003e\n\u003cli\u003eKnow your way around popular scripting languages (Python / Bash / Groovy)\u003c/li\u003e\n\u003cli\u003eA proactive and motivated individual with a willingness to learn\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour power-ups:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGet competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more\u003c/li\u003e\n\u003cli\u003eDe-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more\u003c/li\u003e\n\u003cli\u003eParticipate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting\u003c/li\u003e\n\u003cli\u003eMake the most of our excellent training and development opportunities\u003c/li\u003e\n\u003cli\u003eFeel comfortable in an atmosphere to empower creative thinking and strong results\u003c/li\u003e\n\u003cli\u003eWork in an agile multicultural team – enabling you and your team to form and actively optimize work processes\u003c/li\u003e\n\u003cli\u003eOur company language is English, and we support all our employees and their partners with optional German lessons\u003c/li\u003e\n\u003cli\u003eReceive exceptional support with your relocation to Hamburg\u003c/li\u003e\n\u003cli\u003eShape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur story:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInnoGames is Germany's leading developer and publisher of mobile and online games.\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\u003c/p\u003e\n\u003cp\u003eBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExcited to start your journey with InnoGames and join our dynamic team as a Frontend Developer?\u003c/strong\u003e\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our \u003ca href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\"\u003eonline application form\u003c/a\u003e. Maximilian Kaeding would be happy to answer any questions you may have.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eApply and #stayhome!\u003c/strong\u003e\nDue to the \u003cstrong\u003ecoronavirus\u003c/strong\u003e outbreak, we switched our operations company-wide to home office and turned our hiring process into a \u003cstrong\u003efully virtual one\u003c/strong\u003e.\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\"\u003ehttps://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTZPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ec42b2a061aa3442bb68ddb2c1b7e05e19e5a7dc/logo_innogames_devlop.png"},{"id":"fc91fd74-104d-4d9b-ba0b-b8a31d6ee298","type":"Full Time","url":"https://jobs.github.com/positions/fc91fd74-104d-4d9b-ba0b-b8a31d6ee298","created_at":"Fri Nov 13 20:42:48 UTC 2020","company":"Sky and Ray","company_url":"http://www.skyandray.com","location":"North America","title":"Full Stack Developer (Mid-Level or Senior) ","description":"\u003cp\u003eSky and Ray are looking for a full-stack software engineer to work on a frontier technology FinTech company ( Elixir | Phoenix | iOS | GraphQL | AWS), currently in Stealth Mode.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re simplifying wealth.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re building a high performing team of product experts, designers and technologists to tackle the radical transformation taking place in the finance space.\u003c/p\u003e\n\u003cp\u003eAs a developer, you will work to solve challenging problems and build robust features within a cross-functional team. You’ll have opportunities to shape our best practices, challenge our product assumptions, and ship world-class software.\u003c/p\u003e\n\u003ch2\u003eABOUT YOU:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSomeone who wants to make a direct impact on the Product (SaaS)\u003c/li\u003e\n\u003cli\u003eYou value having a meaningful equity stake in the Company\u003c/li\u003e\n\u003cli\u003eGood sense of humor and believe team culture is paramount\u003c/li\u003e\n\u003cli\u003eYou value autonomy and appreciate real flow state time\u003c/li\u003e\n\u003cli\u003eYou value learning and want to be on a team that will challenge you but also give you the freedom to grow\n*You have current awareness of the most established libraries and frameworks\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYOUR SKILLS:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eSolid programming skills in Elixir\u003c/strong\u003e and a track record of bringing shipping energy.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eExcellent problem-solving skills.\u003c/strong\u003e You are the kind of person who loves digging into a problem space and using technology to solve it.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eHave worked on multi-discipline product teams\u003c/strong\u003e before, either on the enterprise or consumer side.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCommunication is king.\u003c/strong\u003e We won’t need you to present any reports or talk to investors, but you will be expected to communicate daily with the team, expressing concerns and collaborating on problems.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eOpen to sharing.\u003c/strong\u003e We want to see your ideas, and we want you to contribute to ours.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eResilient \u0026amp; adaptable.\u003c/strong\u003e You understand that building products can be messy and that agility is necessary.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eKnowledge of Continuous Integration / Deployment\u003c/strong\u003e\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eKnowledge about choosing the best databases and their characteristics\u003c/strong\u003e (SQL / NoSQL / real-time, GraphQL, etc.)\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eFluency in Git flows.\u003c/strong\u003e\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eExperience working within agile environments.\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eADVENTURE IS WORTHWHILE:\u003c/h2\u003e\n\u003cp\u003eWe're seeking talented individuals in engineering, design, sales, marketing, compliance, and business development to join us in mapping uncharted waters.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWe have but four core values that we believe make the ideal team member:\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe Humble\u003c/strong\u003e\n\u003cem\u003e\"Humility is not thinking less of yourself, it's thinking of yourself less.\"\u003c/em\u003e\n\u003cem\u003e-C. S. Lewis\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe Humane\u003c/strong\u003e\n\u003cem\u003e\"Wise and humane management of the patient is the best safeguard against infection.\"\u003c/em\u003e\n\u003cem\u003e- Florence Nightingale\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe Hungry\u003c/strong\u003e\n\u003cem\u003e“A hungry wolf is bound to wage a hard battle.”\u003c/em\u003e\n\u003cem\u003e- Laxdaela Saga\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe Holistic\u003c/strong\u003e\n\u003cem\u003e\"Nature does not compartmentalize. Its instinct is integrative and holistic.”\u003c/em\u003e\n\u003cem\u003e- Ram Nath Kovind\u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003eABOUT SKY AND RAY\u003c/h2\u003e\n\u003cp\u003eSky and Ray provide a canvas for talented people to realize their dreams. We do this by being equal parts venture incubator, venture investor and family office.\u003c/p\u003e\n\u003cp\u003eWe create un-probabilistic outcomes.\u003c/p\u003e\n\u003cp\u003eWe believe culture is the one thing you can’t over-invest in.\u003c/p\u003e\n\u003cp\u003eWe believe humans are poor substitutes for robots - we believe talent are not resources.\u003c/p\u003e\n\u003cp\u003eThe people at Sky and Ray have helped create eight Global #1 Applications, Deloitte Fast 500 Companies, National Entrepreneurs of the Year and companies with Billions of Assets under Management.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume, description of your superpower, and a link to website / GitHub / LinkedIn profile to \u003ca href=\"mailto:careers@skyandray.com\"\u003ecareers@skyandray.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWVPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--00e1277c57221977da2884cc230671e8d0958846/Sky_and_Ray_Logo_Black.png"},{"id":"0a05fd26-b873-4641-bb0c-ba9ea66e18b2","type":"Full Time","url":"https://jobs.github.com/positions/0a05fd26-b873-4641-bb0c-ba9ea66e18b2","created_at":"Fri Nov 13 20:17:49 UTC 2020","company":"Lightmatter","company_url":"https://lightmatter.com","location":"NYC / Remote","title":"Hiring Senior \u0026 Mid Software Engineers","description":"\u003ch2\u003eWhy Are We Hiring?\u003c/h2\u003e\n\u003cp\u003eWe're continuously hiring for software engineering roles at our company, and welcome candidates with all kinds of programming experience (different languages, frameworks, platforms, etc). We've found that both candidates with traditional CS backgrounds as well as others who are self-taught or freelancers can excel at our company.\u003c/p\u003e\n\u003cp\u003eWe're not interested in hiring for any particular niche skill at the moment. Rather, we like to engage with engineers who have a well rounded and full stack background, either for web or mobile. If you feel particularly strong in one skill though, we still would like to talk.\u003c/p\u003e\n\u003ch2\u003eMore About The Role\u003c/h2\u003e\n\u003cp\u003eAs an engineer at our company, you'll work directly with our CTO and Creative Director and other engineers on a variety of software projects covering different programming languages, frameworks, and application architectures.\u003c/p\u003e\n\u003cp\u003eThe single best reason to be an engineer at our company is because of the exposure to different programming languages, technologies and client projects.\u003c/p\u003e\n\u003cp\u003eTypical client work includes building any of the following: web and mobile apps, public and private API's, static sites and CMS platforms, e-commerce sites like Shopify stores, and digital transformation projects with enterprise clients.\u003c/p\u003e\n\u003cp\u003eFor more information about how we run our Sprints and manage our SDLC, read \u003ca href=\"https://lightmatter.com/playbook/\"\u003eour company Playbook\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eSpecific Qualifications\u003c/h2\u003e\n\u003cp\u003eIdeally, you have experience with the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou have 2+ years working as a software engineer at another agency, a product focused startup, or an enterprise company.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou have spent some time freelancing independently, whether as a side hustle or full time. Almost everyone on our team has been an individual freelancer at one point, and understands the value of all the “work” outside of the actual deliverable for the client: excellent communication, professionalism, punctuality and follow through.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou have 0 ego with regards to your code, can both receive and offer feedback positively, and are willing to pair and help others as develop software alongside you.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou're a self-starter. You're not afraid to take initiative, but know when and how to check with others to ensure you're making the right decision. You can balance the technically correct and/or more elegant solution with what the client wants (which often differs) and can do this quickly.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou're not afraid to ship code! We don't care if it's not done yet. Push it up and get feedback!\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur company does not offer equity as we’re not a venture backed startup. However, there’s the possibility in the future for a revenue share of profit split at year’s end based on tenure.\u003c/p\u003e\n\u003cp\u003eTo apply for this role, send \u003ca href=\"mailto:ben@lightmatter.com\"\u003eben@lightmatter.com\u003c/a\u003e an introductory email and attach your resume and cover letter along with your github profile if applicable.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:ben@lightmatter.com\"\u003eben@lightmatter.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVdPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--520190e5827f8f7b79661c3208cea5e9b3e332cb/lightmatter_L_blk.png"},{"id":"eca51a03-d3e1-42d2-b718-1142b3199826","type":"Full Time","url":"https://jobs.github.com/positions/eca51a03-d3e1-42d2-b718-1142b3199826","created_at":"Fri Nov 13 15:08:21 UTC 2020","company":"Oviavo GmbH","company_url":"https://oviavo.com/","location":"Berlin","title":"(Senior) Frontend / Fullstack Developer (w/m/d) onsite Berlin","description":"\u003cp\u003eWe are OVIAVO and our vision is to become the leading platform for fertility solutions in Europe. We help individuals to better understand the topic of fertility and provide innovative digital and physical solutions by using the latest technologies.\u003c/p\u003e\n\u003cp\u003eBuilding on the success of our current service, we have a great vision for our future digital platforms. To realize this vision we are looking for a (Senior) Frontend / Fullstack Engineer excited to build, grow and scale our products with us. We need the help of a dedicated, curious and versatile developer with a passion for simplicity, performance and security. Does this sound like you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will be an essential part of our interdisciplinary product team and will participate in every stage of the product development lifecycle.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eown the implementation, testing and integration of our platform\u003c/li\u003e\n\u003cli\u003ecollaborate strongly in ideating, prototyping, testing, defining and prioritizing features\u003c/li\u003e\n\u003cli\u003ebe aware of user research results and guide us from a technical perspective\u003c/li\u003e\n\u003cli\u003ehelp us improve our code quality, data security and user experience continuously\u003c/li\u003e\n\u003cli\u003eYou are joining the team in an exciting early stage, although we are well on the way to develop a MVP, there is plenty of room for your ideas. Since we use Typescript in the frontend and backend everybody can participate in both areas.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis means right now you will act more as a generalist but as we grow there will be plenty of opportunities to develop into other roles and specialisations you might be interested in. It goes without saying that we heavily encourage and support learning new skills!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFormal education is not important to us. What matters is how skilled you are, how well you collaborate with your team and how pragmatic you can be if needed.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA few things we would like you to have:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a rather broad range of experience in modern web technologies and consider yourself a versatile allrounder with deep knowledge of how to build modern frontend apps.\u003c/li\u003e\n\u003cli\u003eProficiency with our current tech stack of Node.js, React (PWA), Typescript, GraphQL and AWS\u003c/li\u003e\n\u003cli\u003eYou love to collaborate directly with designers and improve each others knowledge and workflows\u003c/li\u003e\n\u003cli\u003eManaging the full application lifecycle from development to production is something you can't imagine any other way\u003c/li\u003e\n\u003cli\u003eYou have a good understanding of cryptography and security\u003c/li\u003e\n\u003cli\u003eYou would impress us even more if you had some experience with:\u003c/li\u003e\n\u003cli\u003eImplementing complex backends with modern micro service architectures\u003c/li\u003e\n\u003cli\u003eImplementing PWAs and perhaps even publishing them to app stores\u003c/li\u003e\n\u003cli\u003eBuilding mobile experiences\u003c/li\u003e\n\u003cli\u003eData modelling and designing APIs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn attractive employee participation program\u003c/li\u003e\n\u003cli\u003eIn our product team we really try to live up to our understanding of agile, user centric, lean and continuous improvement. We don't hide behind these terms to justify chaotic planning, unrealistic expectations and autocratic decision making\u003c/li\u003e\n\u003cli\u003eGenuine empowerment: We believe that our platform makes a positive difference in the lives of all people, especially for women and LGBTQ+\u003c/li\u003e\n\u003cli\u003eWe have just been successfully financed and have strong investors on our side\u003c/li\u003e\n\u003cli\u003eFlat hierarchies, short decision-making paths and direct cooperation with product leadership\u003c/li\u003e\n\u003cli\u003eWe live a direct, open and appreciative culture\u003c/li\u003e\n\u003cli\u003eYou want to be part of this success story? We are looking forward to receiving your online application with your salary expectation and possible start date.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIMPORTANT:\u003c/strong\u003e We strongly encourage especially women and LGBTQ+ people to apply for this position even if your profile doesn’t match the description 100%. We build a service which aims to reduce inequalities and strives for inclusion and we want our team to reflect it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://oviavo.join.com/jobs/1566612-senior-frontend-fullstack-developer-w-m-d-onsite-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfrontend%2Bfullstack%2Bdeveloper%2Bw%2Bm%2Bd%2Bonsite%2Bberlin\"\u003ehttps://oviavo.join.com/jobs/1566612-senior-frontend-fullstack-developer-w-m-d-onsite-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfrontend%2Bfullstack%2Bdeveloper%2Bw%2Bm%2Bd%2Bonsite%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUdPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dc2fbda8a56d475cd6adcc7a7aa3d1e6d7b6f6d0/oviavo-black.png"},{"id":"315ce7c1-2ec0-4141-b012-907a05d0084c","type":"Full Time","url":"https://jobs.github.com/positions/315ce7c1-2ec0-4141-b012-907a05d0084c","created_at":"Mon Jul 27 15:54:04 UTC 2020","company":"Upserve","company_url":"http://Upserve","location":"Remote","title":"Principal Frontend Engineer","description":"\u003cp\u003eThe Opportunity\u003c/p\u003e\n\u003cp\u003eUpserve is looking for a Principal Frontend Engineer with a design-centric approach and a passion for mentoring to join our web applications team. This team designs and creates both core and supplemental products for Upserve’s customers. Frontend Engineers on this team create compelling and functional UX in collaboration with backend engineers to meet new and existing product requirements with robust, maintainable solutions.\u003c/p\u003e\n\u003cp\u003eWhat You’ll Do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a technical leader, gaining ownership and mutual respect over existing and new areas of the product, and collaboratively design with our customer’s needs as paramount.\u003c/li\u003e\n\u003cli\u003eImbue your team with passion for delightful user experiences.\u003c/li\u003e\n\u003cli\u003eDrive quality and testing methodologies to ensure only robust solutions are delivered.\u003c/li\u003e\n\u003cli\u003eCreate maintainable solutions that meet Product and Engineering needs to grow the business.\u003c/li\u003e\n\u003cli\u003eCollaborate with our Product and UX teams to disambiguate requirements and understand context to create the appropriate interfaces.\u003c/li\u003e\n\u003cli\u003eParticipate in sprint planning, code reviews, and retrospectives.\u003c/li\u003e\n\u003cli\u003eGuide and mentor other engineers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWho You Are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have extensively worked with web technologies and frameworks such as React, TypeScript, JavaScript, Elm, webpack, babel, GraphQL and functional programming concepts such as ramda, reselect, React Hooks.\u003c/li\u003e\n\u003cli\u003eYou understand the web is consumed on many varied platforms with many varied levels of connectivity and bandwidth, and you design accordingly.\u003c/li\u003e\n\u003cli\u003eYou are an experienced and passionate technical leader who is comfortable defining technical solutions to stimulating challenges.\u003c/li\u003e\n\u003cli\u003eYou believe in building robust, rigorously-tested systems and components, and driving our quality bar cross-functionally.\u003c/li\u003e\n\u003cli\u003eYou take pride in your work and the value that it creates, enabling instrumentation and diagnostics post-release phase.\u003c/li\u003e\n\u003cli\u003eYou are a pragmatic idealist -- you strive for efficient and practical solutions not just theoretically ideal ones.\u003c/li\u003e\n\u003cli\u003eYou are a believer in moving fast with care and quality as key tenets.\u003c/li\u003e\n\u003cli\u003eYou enjoy talking about user functionality as much as you enjoy talking about functional programming.\u003c/li\u003e\n\u003cli\u003eYou feel a tremendous sense of urgency to get value to end users, and you tap into that energy to drive, lead, and motivate your colleagues.\u003c/li\u003e\n\u003cli\u003eYou get excited about types and algorithms, and know when to choose the right data structure for the right task.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease follow this link to apply: \u003ca href=\"https://recruit.hirebridge.com/v3/application/applink.aspx?cid=7958\u0026amp;jid=526164\"\u003ehttps://recruit.hirebridge.com/v3/application/applink.aspx?cid=7958\u0026amp;jid=526164\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--421183925e3943f46d6d246b2fbb25fbd8f85fc5/Upserve.Symbol.%20Black.png"}]